[
  {
    "title": "VALORANT Patch Notes 10.00",
    "patch": 10.0,
    "published": "2025-01-07",
    "final_content": "Happy New Year, gamers! Welcome to Season 2025. It’s Kenny here, and I’m beyond stoked to share the first set of patch notes for the year. Patch 10.00 is now live.\nWith 10.00, Tejo explodes his way onto the battlefield with guided ballistics and superior swagger. Anybody know where I can get those glasses?\nAnyway, Fracture and Lotus are back in the Competitive map pool, the new FLEX cosmetic is in your Collections page, Automatic Remake Voting is here, and The Esports Hub is returning soon for the new VCT season. Oh, and we fixed a few bugs.\nIf you haven’t seen it, check out the Tejo Agent Reveal Trailer below in the patch notes. GL HF in the new year, everyone!\nRaze, Sova, and Gekko’s explosions should behave more consistently in how they deal damage.\nTejo is en route. Our newest Initiator from Colombia will be released in a staggered rollout to all regions starting at 9:00 AM PT on January 8th ."
  },
  {
    "title": "VALORANT Patch Notes 10.01",
    "patch": 10.01,
    "published": "2025-01-21",
    "final_content": "Hey folks! It’s Ash and I’m excited to be back at it again for another stellar year of VALORANT. One of my New Year’s resolutions is to hit Immortal for the first time…let’s see how that goes. What’s yours?\nPatch 10.01 is short but very sweet. Rank Shields have been added to Competitive Mode so when you’re in Tier 1 at 0 RR, you have 3 chances to win before dropping to the next rank below. There are also lots of bug fixes for our newest agent, Tejo.\nHappy 2025, y’all. Let’s get it."
  },
  {
    "title": "VALORANT Patch Notes 10.02",
    "patch": 10.02,
    "published": "2025-02-04",
    "final_content": "Hi there, it’s Ash! Hope everyone’s competitive grind is going strong since the Rank Shields were released.\nSmall patch this time but with important bug fixes, of course!"
  },
  {
    "title": "VALORANT Patch Notes 10.03",
    "patch": 10.03,
    "published": "2025-02-18",
    "final_content": "Hey, everyone. Kenny, here. This week’s patch is another small one as we get closer to Masters Bangkok Finals. In it, you’ll find some small updates to minimap clarity, changes to Chamber, Skye, and Harbor’s slow behavior, and a couple bug fixes.\nGL HF!\n(Due to a Riot holiday and our offices being closed, Patch 10.03 will deploy one day later on 2/19)"
  },
  {
    "title": "VALORANT Patch Notes 10.04",
    "patch": 10.04,
    "published": "2025-03-04",
    "final_content": "Hey everyone! It’s Ash here. This is a spicy patch so lock in for these notes.\nHailing from Thailand, Waylay is joining the roster as our newest Duelist! We can’t wait to see your gameplay highlights so get ready to post those insane clutches and aces. There’s also major updates to Clove, Deadlock, Iso, and Tejo, and a small VFX change to Neon. Ascent and Icebox are rotating IN, and Abyss and Bind are rotating OUT. And for the Odin enjoyers on Ascent, you might want to rethink your strategy for how you hold B main.\nAs always, we’re looking at your feedback so please continue to share your thoughts. Happy gaming!\nClove has been overperforming in ranked so we’re making some adjustments to their abilities to keep ranked in a healthy spot. Similar to balance changes we’ve made in the past, we’d like to continue encouraging Controller diversity by making space for other Agents who have similar strengths.\nNo longer explodes after a 1.3 second timer after casting. Explodes after contact with the ground after a 0.75s timer.\nProjectile audio has been updated to fit this new behavior.\nCooldown duration increased from 30s >>> 40s\nHealth buff duration increased from 8s >>> 10s\nMove speed duration reduced from 8s >>> 3s\nTo account for GravNet swapping to a signature, we’ll be shrinking the size and increasing some of its counterplay. Since the skill will be cast more frequently, we’d like to encourage plays to be more intentional and precise about placement.\nChanged to a non-signature ability\nCost: Free >>> 400 credits\nChanged to a signature ability with 40s cooldown\nTotal Size decreased from 16m >>> 13m\nGravnet’s Projectile audio loop has been updated to increase its gameplay clarity.\nWhen an enemy removes the net, the audio cue of the net breaking now plays for all players.\nSince his updates in patches 8.11 and 9.0, Iso has been a bit of a one-trick pony around his Double Tap. These changes are intended to redistribute power around Iso’s kit to make him a more well-rounded agent. Changes to Undercut intend to increase his overall strategic options, and Contingency is receiving an alternate cast paradigm to support slower play and its ability to iso late angles.\nWe’re reverting Iso’s Double Tap tagging change, as trying to kill Iso through his shield is already a highly frustrating and powerful moment.\nChanges to Kill Contract are intended to ensure that won duels in the arena always spawn an orb.\nReduced charges from 2 >>> 1\nCost increased from 200 >>> 300 credits\nNow applies Suppression alongside Vulnerability for the same duration (4s) on players hit.\nThis does not affect the duration of Contingency.\nIso now receives a Heavy Penetration tag rather than a Wall Penetration tag when the shield is broken. This means he’s slowed more upon his shield breaking.\nBUGFIX: If Iso DOES NOT have Double Tap’s buff applied, the ultimate will now automatically apply it so that won ultimate duels always spawn an orb.\nVFX around Neon’s Overdrive have been updated to make Neon and her directionality clearer when she is fighting with Overdrive active.\nSince Tejo’s release, we’ve been monitoring the interaction where Tejo can destroy Killjoy’s Lockdown with his Guided Salvo.\nBut in the case of Tejo’s Guided Salvo cooldown model, both players get into unsatisfying stalemates where neither Tejo nor Killjoy want to be the first person to cast. So we’re changing Guided Salvo so that it requires more teamplay to successfully destroy a Killjoy ultimate. Killjoy’s Lockdown will now survive Guided Salvo with 5 HP.\nDamage decreased from 70 >>> 65\nGuided Salvo now does 50% damage to non-player objects.\nAscent and Icebox are back IN the COMPETITIVE and DEATHMATCH queues.\nAbyss and Bind are OUT of the COMPETITIVE and DEATHMATCH queues.\nWhile bullet penetration is a meaningful system that rewards map knowledge and situational execution, we feel like the weapon spam here at barrier drop is currently creating unhealthy gameplay and frustrating experiences. This change will give Attackers some added safety at barrier drop when first approaching B Main.\nChanged part of the B Main wall along B Lane to non-pennable.\nOverhauled visuals of the detailed damage breakdown panel to be more organized and intuitive.\nChecked in a more systemic fix to an issue where Neon could jiggle her head up and down while sliding if mashing strafing inputs.\nFixed an issue where Fade’s hands got stuck in place if she crouched while holding Nightfall out.\nFixed an issue where the Rank Shield icon on the Match History page would disappear after playing a non-Competitive game.\nThere is a bug where the first person camera angle may be slightly offset from the expected player point of view while spectating another player.\nGenerally speaking, we believe that the best version of VAL is true across all platforms. As a result, we only look to make console-specific changes when absolutely necessary. We’d like to take this opportunity to adjust any changes that may no longer be needed. If you’re curious, we approach this problem by taking a look at data and community feedback to evaluate performance on each platform.\nWe’ve been paying close attention to Neon for a long time on console… After her nerfs in patch 9.11, we looked at her current power-profile and are comfortable in increasing some of her potential.\nHead Damage Multiplier increased 2.5 >>> 3.0 (Standardizing to PC)\nBody Damage Multiplier: 1.0 (unchanged, already same as PC)\nLeg Damage Multiplier increased 0.75 >>> 0.85 (Standardizing to PC)\nFuel Drain Per Second: 0.11 >>> 0.1 (Standardizing to PC)\nYoru often occupies a niche, high-mastery, high-return position in the Agent roster. Yoru’s kit is difficult to master but players can realize significant returns on their time investment. When looking at the data, his power-profile overall was lower than expected for the effort required.\nWe took a look at your feedback around his kit feeling “clunky” on console, and have looked to remove some of the changes that are both making his kit feel more difficult to execute.\nUnequip delay decreased 1.2s >>> 0.8s (Standardizing to PC)\nMax flash duration increased 2.0s >>> 3.0s (Standardizing to PC)\nNote: We’re keeping the console-specific counterplay added to Yoru’s Fakeout.\nMax Flash Duration increased from 1.25s >>> 1.75s (Standardizing to PC)\nFlash Explosion Delay: 0.7s >>> 0.6s (Standardizing to PC)\nNote: Similar to Yoru’s Decoy Flash, Leer continues to have a slightly longer (+0.2s) activation time and duration. This patch does not change that."
  },
  {
    "title": "VALORANT Patch Notes 10.05",
    "patch": 10.05,
    "published": "2025-03-18",
    "final_content": "Hey, everyone. It’s ya boi Kenny here—back with a small but mighty patch 10.05.\nFirst and foremost, Ranked Rollbacks are here! Check out the notes below for more detail, and keep an eye on our social channels for a short video showing how this change will show up in your game client.\nBeyond RR Rollbacks, you’ll also notice some minor Bug Fixes for Agents.\nThat’s all from me. GL HF GG."
  },
  {
    "title": "VALORANT Patch Notes 10.06",
    "patch": 10.06,
    "published": "2025-04-01",
    "final_content": "Hey folks, it’s Ash!\nFor patch 10.06, we’re looking at a nice lil buff for KAY/O that introduces a new mechanic to his flashes causing them to pop earlier upon bouncing. KAY/O’s resurrection time has also gone down by half, so you’ll no longer have to yell at your teammate to watch your back as you res…well you’ll be yelling for half as long at least.\nThere’s also a bunch of bug fixes. For those of you on console who may have seen that you’re not getting progress at the end of each game—don’t worry, it’s a visual bug and you are still getting your progress!\nLastly, we’re adding 4 extra teleporters on Bind and none of them are connected so entering any of them will shoot you out at 1 of the other 5 locations at random. Please let us know how you feel about it!\nUntil next time, happy gaming and don’t forget to 1, 2, 3, flash!\n(The last one is an April Fools’ joke btw, please don’t kill me)"
  },
  {
    "title": "VALORANT Patch Notes 10.08",
    "patch": 10.08,
    "published": "2025-04-29",
    "final_content": "Hey, everyone. It’s Kenny here, wishing you a warm welcome to Act III of Season 2025 and Patch 10.08.\nThis patch brings some Agent balance updates for Brim, Astra, and Yoru, plus the long-awaited Gifting functionality to the Featured Store, and a slew of bug fixes.\nOh, and you might catch a little nostalgia if you listen to the music throughout the game. That Episode 1 menu music really takes me back…\nOk, that’s all from me. GL HF, gamers!\nIn celebration of VALORANT’s fifth anniversary, we are bringing some of the Episode 1 music back in patches 10.08 and 10.09. This includes music for the menus, character select, and Victory/Defeat."
  },
  {
    "title": "VALORANT Patch Notes 10.09",
    "patch": 10.09,
    "published": "2025-05-13",
    "final_content": "Pssst. Wake up, babe. Tejo’s balance update just dropped.\nHiya, friends. It’s Kenny—here to walk you through Patch 10.09.\nToday’s patch has some highly anticipated changes to Tejo, a minor nerf to Breach’s stun, some small updates to starting ultimate points in Swiftplay, and various bug fixes.\nLet’s jump into it."
  },
  {
    "title": "VALORANT Patch Notes 10.10",
    "patch": 10.1,
    "published": "2025-05-27",
    "final_content": "Hey folks! Ash here with the next round of patch notes.\nFirst and foremost, we have some upcoming changes to the client throughout the year, starting with the Collection for patch 10.10. Our goal is to unify the player interfaces for PC and console which means we can reduce the time spent supporting them separately and focus on delivering cool new things more quickly. Sometimes you’ll see nice QOL changes, and other times you might think they’re negligible–either way, it’ll be better for everyone in the long run!\nSeparately, we updated Raze’s explosion VFX to her Boom Bot and Paint Shells and for Tejo, his ult, Armageddon, will start at 3 points instead of 2 in Swiftplay (this was already live in patch 10.09 but we missed it in patch notes)!\nOther hot news: for players under Radiant, we increased the cap of refunded RR you can receive within an Act. Icebox is still disabled for Deathmatch & Escalation to address issues.\nOkay enough chit-chat, hop on."
  },
  {
    "title": "VALORANT Patch Notes 10.11",
    "patch": 10.11,
    "published": "2025-06-10",
    "final_content": "HAPPY 5TH ANNIVERSARY TO VALORANT! Whether you’ve been here since beta or just started recently, we hope you’ve had a fantastic time playing the game and making new memories. It’s Ash here and while my win rate is down, the vibes are up. Let’s talk patch 10.11.\nWe’ve added a Finisher Cam that will trigger for skinline finishers to help combat visual clutter and Icebox will remain disabled in Deathmatch and Escalation to address some issues.\nWe heard you like the new anniversary video so the career page menu music has been updated to a remix of Ego by Qing Madi.\nAnd last but certainly not least, it’s time to tell your 5-stack to start grinding again because there’s updates to Premier! In addition to the gun buddy and title, the winners will also receive a lovely new player card effect that’ll certainly instill fear in your enemies when they see it in the loading screen.\nHere’s to another 5 years of wins and whiffs!\nCheck out our recent dev video for more info on what's coming in Premier next Stage!"
  },
  {
    "title": "VALORANT Patch Notes 11.00",
    "patch": 11.0,
    "published": "2025-06-24",
    "final_content": "Heya folks! It’s Ash and I’m going to get straight into it because this is a BIG patch. Let’s go!\nTLDR;\nAgents\nAgent abilities adjusted = Waylay, Reyna, Phoenix, Neon\nAgent clarity and consistency improvements = Breach, Sova, Clove, Killjoy, Cypher, Omen, Brimstone\nMaps\nNew map = Corrode\nNew mode = Corrode Only queue in Swiftplay for 5 days (to help you learn the map!)\nFor Competitive and Deathmatch = Bind and Corrode are in, Pearl and Split are out\nFor the first 2 weeks of Competitive, Corrode RR losses are reduced by 50%, wins are still 100% (to also help you learn the map!)\nCompetitive\nYou may see less of a drop in rank after completing placements for this midseason reset.\nThe maximum rank you can place is now Ascendant 3 instead of Ascendant 1.\nNow there’s other spicy updates, such as the esports hub coming to console, so grab a coffee and jump in below!\nAs we continue to tune ability strength for consistency, there’s opportunity for a couple of small changes with a few of our Agents so there’s more room for counterplay and opportunities for clutch moments like flicking to turn flashes.\nWe’re also adjusting Neon’s Relay Bolt and Phoenix’s Curveball to have room for some additional counterplay. These abilities are meant to create strong combat advantages, but their fast activation left little time for opponents to respond. These changes aim to increase moment-to-moment counterplay without removing the need to anticipate and position against them.\nThese below changes are part of our ongoing effort to improve gameplay consistency & combat clarity similar to our updates to Neon’s Overdrive visual effects and Deadlock’s Barrier Mesh health states.\nWelcome to Stage V25A4! Participate in Premier to earn new team recognition!"
  },
  {
    "title": "VALORANT Patch Notes 11.01",
    "patch": 11.01,
    "published": "2025-07-14",
    "final_content": "Hey, all. Kenny, here.\nYes, today is when we’d normally put out a new patch. But in order to prepare for the upcoming UE5 upgrade, we’re skipping Patch 11.01 and making any changes scheduled for this patch with 11.02, coming July 29. Just wanted to let you all know.\nSoooo, that’s it. Those are the “patch notes.” See you in a couple weeks!"
  },
  {
    "title": "VALORANT Patch Notes 11.02",
    "patch": 11.02,
    "published": "2025-07-29",
    "final_content": "Hey, all! It’s Kenny.\nToday marks a significant milestone for VALORANT. We are making the upgrade to Unreal Engine 5. While you might not notice a whole lot of change right now, this upgrade will bring a whole new world of possibilities to VALORANT in the years to come.\nDon’t forget to check out your gun buddy collection later today and show off your “Hot New Engine” gun buddy if you’re a fan of cool new tech.\nBeyond that, enjoy some bug fixes! Nobody likes bugs in video games, right? Unless you’re a speedrunner or something…\nAnyway, that’s it. GL HF GG."
  },
  {
    "title": "VALORANT Patch Notes 11.04",
    "patch": 11.04,
    "published": "2025-08-19",
    "final_content": "HELLOOO everyone! It’s JOY and it’s my first time joining the patch notes gang. 👋 This one is short and simple, but here’s a TLDR in case you still need it.\nTLDR;\nGENERAL UPDATES\nAGENT UPDATES\nGAMEPLAY SYSTEMS UPDATES\nMAP UPDATES\nBUG FIXES\nKNOWN ISSUES\nBUG FIXES"
  },
  {
    "title": "VALORANT Patch Notes 2004",
    "patch": 2004.0,
    "published": "2023-04-01",
    "final_content": "We’re interrupting our normal patch cadence as we have made some updates to VALORANT that have been in the works for a while now. We have also been made aware that our typical patch notes are hard to understand for everyday VALORANT players such as yourself.\nCheck out the changes to VALORANT below along with a translation so that everyone can understand just what exactly is going on. Enjoy!"
  },
  {
    "title": "VALORANT Patch Notes 5.01",
    "patch": 5.01,
    "published": "2022-07-12",
    "final_content": "We believe Phoenix's Curveball is the cornerstone of his kit, and as we explored adjustment options it became clear that Curveball being more powerful unlocks his kit as a whole. So we wanted to assess Phoenix in a world where Curveball is more competitive with the rest of the ecosystem to get a sense for the impact of the changes. We view Phoenix as an aggressive entry Agent, so the additional Run It Back and Blaze changes are intended to support his proactive intentions when taking space or fights early on into rounds.\nCurveball (Q)\nBlaze (C)\nRun it Back (X)\nWe’ve noticed you Yoru players having a bit of friction achieving the dream of setting up a master plan while in ultimate. We’re hoping these changes will reduce a bit of that problem, rewarding you for using your flash during ultimate, while still preventing unhealthy play patterns that leave enemies without counterplay.\nDimensional Drift (X)\nKAY/O hasn’t had much of a quality of life pass since we’ve last had some changes so we wanted to reduce some pain and help you access more parts of the kit that haven’t felt as accessible.\nFRAG/ment (C)\nNULL/cmd (X)"
  },
  {
    "title": "VALORANT Patch Notes 5.03",
    "patch": 5.03,
    "published": "2022-08-09",
    "final_content": "As players in both ranked and pro play have mastered Chamber, his strengths have started to overshadow his weaknesses, making the counterplay to Rendezvous and his arsenal not as effective as we’d hoped. Chamber’s overall strength has also felt outsized, and we believe that we can reduce the complete power of his kit while still keeping him competitive with the rest of the roster.\nRendezvous (E)\nTrademark (C)\nTour De Force (X)\nHeadhunter (Q)\nWe're updating the ultimates for the following Agent so that they follow similar regional damage rules to our weapons—where hitting the head and legs of an enemy applies different damage multipliers. Intent is to reward precision and create intuitive consistency across damage in VALORANT.\nFor Neon specifically, it also gives us more tuning levers for balancing her across different skill levels. This change should also add depth to the mastery needed when tracking while sprinting that her ult demands.\nOverdrive\nTour De Force (X)\nBladestorm (X)"
  },
  {
    "title": "VALORANT Patch Notes 5.04",
    "patch": 5.04,
    "published": "2022-08-23",
    "final_content": "Don’t forget! It’s the start of Episode 5 Act II , so keep an eye out for all the updates not reflected below, like a fresh Battlepass, Competitive reset, a totally free Event Pass that celebrates Champions 2022, and then there’s a new limited skinline…maybe you’ve seen that trailer? The one that makes you feel like you’re shooting esports at people.\nWe’ve added a few quality of life improvements to crosshairs and are excited to share them with you!"
  },
  {
    "title": "VALORANT Patch Notes 5.05",
    "patch": 5.05,
    "published": "2022-09-07",
    "final_content": "Keeping this one on the lighter side again while we watch the best VCT teams exchange blows over the VALORANT Champions 2022 crown . Still some important bug work from our Social & Player Dynamics team below!"
  },
  {
    "title": "VALORANT Patch Notes 5.06",
    "patch": 5.06,
    "published": "2022-09-20",
    "final_content": "Since the launch of Pearl in the summer, the map team has put in work based on months-worth of feedback to make the first major update to the underwater map. There are some good bones here, it just needed a quick fixer upper.\nThe Stinger is also dropping from the rafters with some new facepaint, in the form of primary and alt-fire changes.\nPearl is getting a handful of small updates that aim to reduce some complexity and make it easier to move through a few areas for both attackers and defenders.\nBefore:\nAfter:\nBefore:\nAfter:\nBefore:\nAfter:\nBefore:\nAfter:\nBefore:\nAfter:\nBefore:\nAfter:\nBefore:\nAfter:\nBefore:\nAfter:"
  },
  {
    "title": "VALORANT Patch Notes 5.07",
    "patch": 5.07,
    "published": "2022-10-04",
    "final_content": "The VALORANT Character Design team is constantly discussing the state of the Agent meta, and wanted to make some changes to sharpen some of our Agents and role definitions. We’re in a more stable state since Champions, and Game Changers teams will have decent time to acclimate before the Game Changers World Championships takes place.\nWhen it comes to Duelists with a flash ability, many of them have been outclassed by some of our Initiators when it comes to generating kills for themselves off their flashes. Skye and KAY/O are often better at taking aggressive 1v1s than Agents that we expect to be able to thrive in those scenarios like Yoru, Phoenix, or Reyna.\nThese changes are intended to increase the total teamplay output of Skye and KAY/O when they coordinate plays with their teammates, and decrease some of their efficacy when played alone. We also hope to increase the reward for putting more time into mastering their flash abilities. We believe that Initiators should still be able to make solo plays, but they should ideally be weaker than their Duelist counterparts in these scenarios. —Dan “penguin” Hardison, Designer\nGuiding Light’s destructibility didn’t feel like meaningful counterplay, instead overtly punishing when Skye tried to throw them at a longer range. By increasing the top-end output and rewarding Skye for bending her birds into the right spots, we intend to foster more teamwork and differentiate her Guiding Light from other flashes in the game—especially when compared to Duelists.\nKAY/O’s underhanded FLASH/DRIVE (right-click) has been overperforming relative to other “pop” flashes (example, Phoenix's flash or Yoru’s flash). And we feel as though labbed out left-click overhand throws aren’t generating a powerful enough reward for the mastery required to get them to pop in the right place. This tuning weakens the right-click when compared to pop flashes from Duelists, with the belief that KAY/O should pay a cost for his versatility.\nReyna’s flash underperforms as a selfish entry-tool, especially at higher skill levels. This set of changes is intended to give Reyna more agency around how she decides to peek after casting Leer. Also, it should sharpen Leer as a powerful angle-breaking tool against Operators on maps with longer sightlines. We’ve also felt like individual casts of the eye remain in the world for too long when the eye isn’t destroyed. If Reyna is now able to make more selfish plays off her Leer, we then wanted to reduce some of the value it has when thrown for teammates.\nYoru is a tricky agent, as we need to balance him around his capability to throw flashes during his ultimate. We opted to go with a simple duration increase for Blindside as we feel maintaining the turning counterplay around his flash and clone is important to avoid excessively frustrating situations.\nFracture is receiving quite a few quality of life changes alongside some larger updates to Dish/A Drop and A Ropes. Going to go in the order of minor to major changes.\n—\n—\n—\n—\n—\n—\n—\n—\nBelow are features that we’ve wanted to make for a while just as much as you’ve wanted them. We’ll admit, there’s still so much more that we can do, like inclusion of additional filtering options, a search function, expansion of the random feature to other content types, and more. The team wants it and are working on it—but we didn’t want to wait until every possible option was covered for us to release the changes here. Better a version of something than not having it at all.\nThis team shares the same belief as the rest of VALORANT: that the value of a “live service” game means we can develop with you and improve over time. It does mean that sometimes new stuff may seem bare bones as we vet a feature’s value, incrementally. As we push forward with both Favorites, Filters, and Randomizer (along with other QoL) we’re taking this step by step approach. Give us your feedback so we can improve this game together. — Micah Worsham, Manager, Game Production"
  },
  {
    "title": "VALORANT Patch Notes 5.08",
    "patch": 5.08,
    "published": "2022-10-18",
    "final_content": "Reminder: this is the start of Episode 5 Act III and that means there’s a number of new things that aren’t featured below: the return of the Ion skinline, a whole new Battlepass and a reset of ranks.\nWe’ve seen an increasing number of you enter the Immortal leaderboard, even after raising the MMR requirement for Immortal. We agree with feedback that in some regions there are too many players on the leaderboard, and after a certain number leaderboard rank loses a lot of it's luster. We are rolling out a cap to the amount of players that can appear on the leaderboard on a region-by-region basis. This will not take away the achievement of reaching Immortal, but until you are in the top X amount of players, you will not appear on the leaderboard."
  },
  {
    "title": "VALORANT Patch Notes 5.09",
    "patch": 5.09,
    "published": "2022-11-01",
    "final_content": "How’s your Episode 5 Act III going so far? Either way, patch notes are light this time around as we prepare for larger changes coming later in the year.\nAgents"
  },
  {
    "title": "VALORANT Patch Notes 5.10",
    "patch": 5.1,
    "published": "2022-11-15",
    "final_content": "We’re back with Patch Notes 5.10 and we’re addressing some of the larger issues players have had with Cypher and Fade in the past. Also included are a bunch of Agent bug fixes and a new feature called Real Time Text Evaluation so that players can feel safer engaging with their teammates and opponents. Read more about it below.\nAs the game has evolved, we’ve seen Cypher’s presence and relative impact on the roster fall off. While we attribute part of this to Chamber coming to dominate the Sentinel slot more than we think is healthy, we also have found that overtime Cypher’s Trapwire setups have become too predictable and easy to counter and that his Ultimate has felt lacking both in restrictions required to pull it off and the reward for doing so. The increase in Trapwire distance should open up a lot of new potential setups for Cypher and allow him to mix up his play patterns in a way that forces his enemies to slow down and move carefully through the map if they want to spot them without being caught.\nRemoving the time restriction on enemy corpses should make his Ultimate more accessible than it has been in the past and allow for Cypher to feel more agency when he initiates Neural Theft, while adding a second ping should create a clearer period of time where Cypher is pulling the strings, taking in the information on the enemies initial location and setting up strategic moves based on the pressure of the second. We hope that these updates get Cypher mains out there coming up with new setups for their information webs and that, when paired with upcoming updates to Chamber, help him reclaim a compelling spot amongst his peers.\nFade's Prowlers have been a versatile and difficult-to-play-against ability that we're looking to sharpen with these changes. The duration changes encourage Fade to be more deliberate in the areas that she chooses to sweep, while the other tweaks to the ability are meant to help enemies on the counterplay side of things.\nThe Nightfall cost is increasing in price, as we've found the baseline value of the Ultimate to be on the higher end compared to other Ultimates in the game.\nHarbor abilities all make a healthy round impact, but we saw some players new to Harbor not using their abilities enough and feeling too constrained. We hope these changes make it easier for players to hit the ground running with Harbor and for skilled Harbor players to achieve more flexibility when controlling the map."
  },
  {
    "title": "VALORANT Patch Notes 5.12",
    "patch": 5.12,
    "published": "2022-12-06",
    "final_content": "Last patch before the end of the year—and it’ll be a long one (last until Patch 6.0 goes live in January). Check out what we’ve got going on in Patch 5.12 below.\nWith pro play heading into the offseason after the completion of an amazing Game Changers Championship, we’re taking the opportunity to hit some broad updates we’ve been looking to make along with individual Agent changes.\nWe've increased the point costs of the Agent Ultimates that have large, site-wide footprints. These changes should reduce their overall frequency and increase counterplay against them at the strategic level.\nIn addition to the Ult adjustments, we've also made a tuning pass on Agent ability economy. The areas targeted in this pass include: Total loadout cost outliers (for their respective role), Agents with lack of pistol round buy options, and unintended power relative to the cost of the ability.\nTo wrap up the broad updates, we’ve taken a pass at the HP of destructible objects in the game. Damage-over-time area abilities (like Brimstone’s Incindiary and Viper’s Snakebite) now damage enemy utility ( read more in the Gameplay Systems Updates ), so we’ve increased the health of 1hp destructibles so that they aren’t instantly vaporized—but can still be destroyed by one-shot in most situations. Also, Killjoy’s Lockdown gets a bigger health bump to reduce the number of abilities that can destroy it solo. Boombot and Prowlers on the other hand have felt like they require unloading too many bullets given their other strengths, so the health of those abilities have been reduced.\nWe're back again with small Harbor buffs. It is hard to learn a new Controller smoke style and we hope these changes make it easier for Harbor's vision block to last long enough to finish executing with their team, while also providing wall smoke duration that’s on par with Viper. We’ll continue to monitor Harbor’s strength and see if we need to make any more waves. Chalo!\nWe’re looking to slightly refine Sage's strengths to be more about fortifying areas she controls and helping allies, rather than offense-focused with her utility. We’re hoping the heal update will push her power and satisfaction when fully healing others while creating tradeoffs for playing Sage overly aggressive and relying on self-healing.\nWe’re reeling in Viper’s ability to play outside of her ultimate’s smoke area. These changes will anchor Viper more to her ultimate and allow coordinated retakes against Viper’s Pit to be more successful.\nAssist tails are the “grace period” duration after a debuff has expired where a player will still be awarded an assist for debuffing the killed target.\nWith damage-over-time area abilities now universally damaging utility, we took a pass on damage multipliers. These area damage abilities cover a wide space and deal large amounts of damage over their duration. We’ve reduced their non-player output to 50% of base damage to prevent instant destruction of enemy utility and to ensure abilities with higher health, such as Sage Barrier Orb, retain their relevant impact.\nThe following abilities are now immune to allied damage.\nWe felt the Spectre was overperforming at mid to long ranges and, as a result, was crowding out other options on partial buys.\nSwiftplay Beta is playable Dec. 6 through Jan. 10, 2023. Please jump in, help us test this new game mode, and give us your feedback!"
  },
  {
    "title": "VALORANT Patch Notes 6.0",
    "patch": 6.0,
    "published": "2023-01-10",
    "final_content": "Jo-Ellen, here. Happy New Year, y’all—we’re starting off 2023 with Patch 6.0. Aside from our new map, Lotus (which you should definitely check out), the Araxys skinline, new Battlepass, and ranks being refreshed, we’ve still got some changes to the game in this patch we wanted to let you know about.\nRead below on Split returning with some updates (where my Split lovers at?), a change to Ranked Rating (RR) gains and losses, and (what many players have been asking for) the ability to finally favorite variants.\nNew Map: Lotus\nSplit\nSplit is returning with a few tweaks to make attacking a little easier.\nMap Rotation\nOmen’s Dark Cover (E)\nAgent Utility\nOverall, the changes below should make Ranked Rating gains and losses feel more consistent, and reduce the effect stomps have on your RR. We’ll keep a close eye on the data to make additional adjustments as necessary.\nCosmetics\nMaps\nAgents"
  },
  {
    "title": "VALORANT Patch Notes 6.01",
    "patch": 6.01,
    "published": "2023-01-18",
    "final_content": "Hello! Jo-Ellen here. Patch Notes 6.01 is a short one and it's focused on Lotus (including bug fixes that you helped point out).\nAlso, how are you liking Lotus so far?\nReplication has been removed from Modes queue."
  },
  {
    "title": "VALORANT Patch Notes 6.02",
    "patch": 6.02,
    "published": "2023-02-07",
    "final_content": "Stinger balance, lots more bug fixes, and one welcome change to help when playing against high-ping.\nThe Gameplay Systems change should be subtle but it’s intended to minimize the impact another player’s networking conditions have on your game.\nWhen a player fires a shot, it takes time for the input to reach the server. To prevent you from needing to lead your shots, VALORANT implements server rewinding. When the server determines the outcome of a shot, it rewinds character positions around the bullet to match their locations at the time when the shot was initially fired. Finding the right limit for a max rewind amount is important for reducing cases of anyone feeling like they need to lead shots, or that they can still be shot after safely repositioning themselves.\nWhen we launched the game, the max rewind value was set to 200 ms based on what we deemed as acceptable networking conditions (factoring in some amount of additional input/processing latency) to play VALORANT. Based on player data since launch, we’ve determined that this value is too high for the networking conditions experienced by most of you. —Kevin Lee, Software Engineer\nWe feel that the Stinger is overperforming at medium to long range engagements at its price point. Force buying Heavy Armor and Stingers on both round 2 and 3 was too effective and lacked the appropriate nuance and economic tradeoffs. We hope that players can occasionally still access this strategy granted they have the credits to do so."
  },
  {
    "title": "VALORANT Patch Notes 6.03",
    "patch": 6.03,
    "published": "2023-02-14",
    "final_content": "Hello! Jo-Ellen here. Thank you for all your feedback on Swiftplay. We’re happy to hear how much you love this mode. Additionally, we’ve got a Killjoy and Raze update—and even more bug fixes.\nWith Chamber’s recent balance and the increased reliability of Killjoy’s Lockdown ult, she has recently sprung up as the premier Sentinel Agent in the game. When we took on systemic damage and health interactions in Patch 5.12, we decided not to reduce Killjoy’s Turret health given her place in the ecosystem at the time. Given her place today, we are making the changes below.\nWe feel the duration of Boom Bot has led to a larger recon footprint than we felt was healthy, in regards to the ability’s secondary output. We are decreasing the amount of space the ability can cover in order to sharpen Boom Bot as a tool Raze and her team can use to follow up around angles."
  },
  {
    "title": "VALORANT Patch Notes 6.04",
    "patch": 6.04,
    "published": "2023-03-07",
    "final_content": "Prepare your aim for the start of Episode 6 Act II. New Initiator Agent, the return of the Oni skinline, rank reset, and a fresh Battlepass. Check out the updates and bug fixes below.\nGekko goes live!"
  },
  {
    "title": "VALORANT Patch Notes 6.05",
    "patch": 6.05,
    "published": "2023-03-14",
    "final_content": "Hi, Jo-Ellen here. How are you liking Gekko and his buddies so far? Either way, with each new Agent comes many new bugs to fix and updates to deploy—we listed the most important ones for Gekko below.\nAlso in this patch, we’ve got bug fixes and updates for Gameplay Systems, Social, and Performance."
  },
  {
    "title": "VALORANT Patch Notes 6.06",
    "patch": 6.06,
    "published": "2023-03-28",
    "final_content": "Hello, Jo-Ellen here.\nShort patch notes this time around. Check out changes we made to Gekko, Lotus, and Agent outlines below."
  },
  {
    "title": "VALORANT Patch Notes 6.07",
    "patch": 6.07,
    "published": "2023-04-11",
    "final_content": "Hi! Jo-Ellen here.\nBind has finally returned. You’ll notice some significant changes after being out of the Unrated and Competitive queues for a while so let us know what you think.\nAlso in this patch notes: Sova’s Recon Bolt has some updates and there are also changes to our AFK/queue dodging interventions system.\nIn an effort to consolidate and make consistent our use of UI indicators throughout our roster, we’ve updated some abilities to have or not have UI indicators.\nWe have made improvements to our interventions system for violations when it comes to player participation.\nYou can read more about this here ."
  },
  {
    "title": "VALORANT Patch Notes 6.08",
    "patch": 6.08,
    "published": "2023-04-25",
    "final_content": "Hi, everyone! Jo-Ellen here.\nNew Act, new patch. We’ve got a lot in store starting with 6.08: Bind is back in Unrated and Competitive modes but Icebox is out, we’ve also made improvements to Gekko’s audio and updated Killjoy’s abilities. Also, there’s a Shorty cosmetics update for certain skinlines including the default Shorty.\nAs Killjoy has taken on a more prominent place in the meta, we’ve noticed a couple of areas where we could improve the ways her abilities interact with other players/the environment. We’ve done a pass on some of her audio cues to make them more distinct and make it clearer when her utility has been destroyed. In addition, we’ve increased the reveal radius on Nanoswarm (C) to better match its area of damage and make it more realistic for enemies that are moving methodically to track them down. We’ll be keeping a close eye on this balance point moving forward. Finally, we’ve removed the yellow warning indicator that was added to Lockdown (X) last patch, as it was too noisy on screen for the full duration of her ultimate winding up.\nWe have upgraded several Shorty models, including the default Shorty, to get them up to par visually with the rest of our weapons. These are just art updates—there will be no gameplay changes."
  },
  {
    "title": "VALORANT Patch Notes 6.10",
    "patch": 6.1,
    "published": "2023-05-23",
    "final_content": "Hello, all! Jo-Ellen here.\nYou’ll notice a few new things in this patch: the Spray Wheel, a different looking Spray display on your Collections page, and a few updated Agent portraits. Many of these features we’re excited for ourselves. We’ve also fixed a number of Yoru bugs whether for when you’re playing against or as him. Lastly, get into a game and listen for some new Reyna voiceover lines.\nAs always, let us know what you think about all the newest things coming to Patch 6.10. Enjoy!\nSpray Wheel, Collections Rework, Spray Equip Flow Improvements\nWe have been cooking up some new features to allow you greater flexibility when using and collecting Sprays and we are happy to launch our first iteration of these improvements with this pass. Introducing the Spray Wheel!\nWe hope you’re as excited about this as we are! We acknowledge this is a large change and will take some getting used to. As such, we’ll be listening closely to user feedback as you get used to the new system and making improvements and adjustments in the future.\nSpray Wheel"
  },
  {
    "title": "VALORANT Patch Notes 6.11",
    "patch": 6.11,
    "published": "2023-06-06",
    "final_content": "Hey, everyone! It’s Jo-Ellen here.\nOur Agents and Weapons teams have been hard at work on some minor and major changes for a few of your favorite Agents and weapons including Chamber, Viper, the Shorty, and the Frenzy. We’ve also made a few updates to Pearl’s B Site.\nAs always, let us know what you think about all the updates in Patch 6.11. Have fun!\nChamber has taken a backseat in overall pick-rate after the last round of changes in Patch 5.12. At the time, we reduced Chamber’s sphere of influence significantly. We’re looking to put more power into his ability to lurk, and give him more flexibility within his setups.\nThe Viper change below is meant to both create more explicit downtimes when playing around her utility, and address the multiplicative effects of Viper and Harbor’s vision block.\nWe want to ensure Viper and Harbor can be competitive independently, while also allowing room for teams to explore strategies that can counter them. This change retains Viper’s power moments while her utility is active, but asks you to be more precise on when to use it—giving attackers more agency and value in baiting out her fuel, and defenders a larger window to play around it during retakes. It also creates some moments of downtime when Harbor and Viper cycle their walls.\nAs always, we’ll be watching how these changes play out in the coming months and evaluating if any further updates are needed.\nWe've felt that Pearl's B Site has been problematic due to how difficult the site is to hold as a defender in conjunction with the amount of strong post-plant options available to attackers. With that in mind, we wanted to get a smaller scale update out before Champions to address those concerns.\nWe’ve adjusted the weapon spread on ropes across most weapons to make combat efficacy while on ropes a touch more difficult. This should allow combat on ropes to be viable in close range scenarios—which we feel is important to make them a viable map traversal tool—but much less often will it be a good choice in medium to long range engagements.\nWe like that the Shorty has found a viable role in the game though it has proven to be too reliable and accessible. We’re increasing the price to make purchasing the Shorty a more thoughtful decision throughout the course of the game while the damage adjustments require more accuracy to get one shot kills against fully armored opponents.\nThe Frenzy has been more potent at long ranges than we’d like. The spread (error) and recoil changes will make long range fights tougher while retaining much of the Frenzy’s short range power.\nError Power (also known as Center Biasing for us) is a tool we utilize to reward accuracy by biasing shots toward the center of the crosshair.\nWhile this system is functioning as intended for stationary firing, it’s been unintentionally aiding firing while on the move. We’ve significantly reduced center biasing in these movement states: shots fired while moving are now almost uniformly random within their spread cone, meaning that fewer of these shots will precisely land on target.\nEven so, Run-and-gun (and jump shooting) kills will still happen—and we think these kills are healthy in close range contexts with the right weapons—but this error power adjustment should help to reduce their frequency a moderate amount, particularly at longer ranges.\nFor a handful of weapons, we’ve increased vertical recoil while firing on the run. This makes the weapons feel less controllable in this state, and should reduce the number of incidental run-and-gun kills.\nWe wanted to inject more decision making when wall penning common spots or blind firing through smokes with the Phantom and Vandal. We’ll keep a close eye on the adjusted ammo reserves for these guns to make sure these weapons are still able to deal with shootables like Sage’s Barrier Orb (C) and Harbor’s Cove (Q)."
  },
  {
    "title": "VALORANT Patch Notes 7.0",
    "patch": 7.0,
    "published": "2023-06-27",
    "final_content": "Hello, all! It’s still Jo-Ellen here.\nWelcome to Episode 7 Act 1. We’ve got a number of things in store for you including a bunch of bug fixes (because who doesn’t love those?), a whole new Agent, new game mode, and an update to our Progression System.\nAlso, peep some updated ability descriptions in-game. Enjoy!\nFor more information, check out our Progression Update Explainer + FAQ here ."
  },
  {
    "title": "VALORANT Patch Notes 7.01",
    "patch": 7.01,
    "published": "2023-07-11",
    "final_content": "Hi, everyone! It’s Jo-Ellen here.\nMastered Deadlock’s Ultimate yet? Or gotten a 4k with your Neo Frontier Sheriff? Either way, we always welcome feedback so please let us know how everything’s working.\nAlso, Premier’s Ignition Stage is open so grab some friends and compete!\nIgnition Stage is live!\nCheck out our FAQ for all the nitty gritty details."
  },
  {
    "title": "VALORANT Patch Notes 7.02",
    "patch": 7.02,
    "published": "2023-08-01",
    "final_content": "Hello, all. It’s still Jo-Ellen here.\nIf you call yourself a Deadlock player, we’ve fixed a number of Annihilation bugs. Also something to look out\n    for—what will Jett say?"
  },
  {
    "title": "VALORANT Patch Notes 7.03",
    "patch": 7.03,
    "published": "2023-08-08",
    "final_content": "Hey, everyone. It’s Jo-Ellen here.\nIn this patch: an update to muting people, some quality of life changes when purchasing or unlocking items after a game, and more.\nFavoriting After Purchase and End-Of-Game Unlock\nNavigation to Sprays Collection"
  },
  {
    "title": "VALORANT Patch Notes 7.04",
    "patch": 7.04,
    "published": "2023-08-29",
    "final_content": "Hey, y’all! Jo-Ellen here.\nYou've made it to Episode 7, Act 2—welcome.\nWith every new Act comes a good number of updates, changes, and additions. Say hello to Sunset, our newest map set in Riot’s hometown. Also in this patch is a bunch of Agent updates as well as the implementation of the changes to Breeze that we gave you a preview to a couple of weeks ago.\nWe always welcome your feedback so please let us know what you think. Thank you!\nVALORANT asks you to make tough decisions when interacting with enemy utility—shooting, dodging, and timing your moment to take a decisive action. We want everyone to come away from rounds feeling like they had the possibility of making a better play if only they were a little faster or smarter. The team has noticed that when faced with multiple pieces of utility or some of larger scale ultimates, your avenues for counterplay can sometimes be overloaded, leading you to feel unsure of what's happening or what you could do differently next time.\nWhile Patch 7.04 includes changes to over half of the roster, the changes are sharply focused on increasing game state clarity by making the following adjustments:\nReducing the frequency of large area of effect of ultimates\nReducing the amount of time utility is active in the world\nReducing the HP of shootable utility\nWe also believe the Ultimate cost updates below better align large area, high-impact ults with the pressure they place on the enemy, creating both a better pacing of the round-defining abilities and a clearer choice competition between high and low cost ults.\nThough many of these changes are subtle, We hope all together they improve gamestate clarity and the sense that you have even more opportunities for your skill to shine through.\nAftershock (C)\nTicks reduced from 3 to 2\nDamage increased from 60 per tick to 80\nRolling Thunder (X)\nUltimate points increased 8>>>9\nOrbital Strike (X)\nUltimate points increased 7>>>8\nProwler (C)\nTime to re-equip gun takes slightly longer after using the ability\nMosh Pit (C)\nThe impacted area does 10 damage per second before exploding\nWingman (Q)\nHP reduced 100>>>80\nThrash (X)\nThrash’s explosion had a little makeover to make it easier to see and understand the area it has affected (on top of being beautiful)\nLockdown (X)\nUltimate points increased 8>>>9\nParanoia (Q)\nNo movement velocity imparted when casting\nSkye has become a keystone of the current meta through her blend of recon and space taking utility. While we like that she can potentially unlock new comps through this combo, we think she has lacked clear weaknesses compared to her peers given the wide range of value she brings. These changes reduce the distance in which Guiding Light can provide info. Changes also helps reduce the amount of time enemies need to worry about her flash when she flies it a great distance without activating it. We’ve also reduced the health of Trailblazer and Seekers to make them slightly easier for enemies to deal with, Skye’s ultimate cost will increase to better reflect the high level of baseline value it provides.\nWe’ll be keeping a close eye on these updates to see if they push the choice competition between Skye and her peers into a healthy place, or if further updates are needed in either direction.\nGuiding Light (E)\nMax duration while casting reduced 2.5s >>>2s\nTrailblazer (Q)\nHP reduced 100>>>80\nSeekers (X)\nUltimate Points increased 7 >>>8\nSeeker Health decreased 150>>>120\nRecon Bolt (E)\nTotal number of scans reduced 3>>>2\nViper’s Pit (X)\nUltimate points increased 8>>>9\nWe've noticed a large power disparity between Astra’s Gravity Well and Nova Pulse. Our goal is to create clearer use cases for both abilities: Gravity Well will be Astra’s tool for controlling space, and Nova Pulse for quickly affecting an area. At the same time, we hope to reduce some of the oppressive and long duration pressure Astra’s stars produce by providing enemies a chance to push past activated Gravity Well during its windup period if they act quickly.\nWe're updating Cosmic Divide to help clarify the overall game state by eliminating uncertainty around whether you or your enemies are close enough to the wall to be heard. We also think this gives Astra’s wall a clearer power profile for her and her allies to play around.\nGravity Well (C)\nStartup time increased .6>>>1.25\nGravity time duration decreased 2.75>>>2.0\nNova Pulse (Q)\nStartup time decreased from 1.25>>>1.0\nCosmic Divide (X)\nAudio now is blocked completely by the wall rather than muffled\nSince the last time we released changes to Jett, she has continued to be a mainstay of both competitive and professional play. We like that the dash changes in 4.08 pushed her to be more deliberate and tactical, but still feel that Jett is often given more reliable power windows and generous tuning than other Duelists and Agents in general.\nOur goal with these changes is further sharpening Jett as the aggressive, high precision Duelist by increasing the intentionality of her ability usage and power windows. We want to maintain her unique ability to break through chokes and dash onto site, while reducing her defensive power-holding angles and her ability to reactively undo tactical mistakes with her array of quickly cast abilities.\nWe believe these changes align Jett’s overall power level and place in the Tactical Cycle with our other Agents, while maintaining Jett’s unique role and fantasy on the VALORANT roster. To help explain our thought process, we’ve provided context on how each change aims to support these goals, and we’ll be keeping a close eye on how these changes land at all levels of play.\nTailwind (E)\nDash window decreased 12s>>>7.5s.\nAt 12s, Jett could often find value activating her dash without clear intention or make incorrect calls but still have time to find another use for the dash. Shortening this window pushes Jett to be more deliberate with her calls and reduces Tailwind’s power at defensively holding angles, while minimally impacting her ability to proactively use the dash to break onto a site.\nActivation windup increased 0.75s>>>1s.\nIncreasing Tailwind’s windup should promote proactive use by reducing Jett’s ability to activate it reactively when caught off guard or in the middle of a fight and successfully escape.\nCloudburst (C)\nDuration decreased 4.5s>>>2.5s\nTime to re-equip gun takes slightly longer after using the ability.\nWe want to reduce some of the persistent safety Jett gets dashing into or escaping with smokes, sharpening Cloudburst to be a fast but powerful tool that forces players to be quick and precise with their decisions.\nUpdraft (Q)\nCharges decreased 2>>>1\nWith two Updrafts, we’ve seen moments where Jett escapes situations where they’ve been tactically outplayed by throwing enemies off by relying on Updraft’s unpredictable movement. We hope to reduce some of the unhealthy movement extremes Updraft can produce and increase the importance of using it at the right time.\nBlade Storm (X)\nUltimate points increased 7>>>8.\nJett’s ultimate has proven one of the most flexible, reliable and economically powerful gun replacement Ultimates because of its lack of a timer, reset on kills, and harmony with Jett’s movement. This change should bring Blade Storm up to the same cost of comparable weapon ults, such as the Tour De Force and Showstopper.\nBreeze will be rotating back into the Competitive and Unrated map pool.\nPlease note that Fracture and Pearl have been rotated out of the Competitive and Unrated map rotation.\nSunset, our newest map, features three lanes and two sites.\nPlease note that the Sunset Only queue will only be live for one week, and that all Sunset Only games will be in Swiftplay mode. Sunset will also be in the map rotation for Unrated. It then goes into the Competitive map rotation in Patch 7.05.\nBreeze’s scale and size are core to the map’s design but we wanted to address rotation times by simplifying where threats could be to make retaking less dangerous. This set of changes aims to add more tradeoffs to A and B site slams that utilize post-plant utility to secure the round while adding more incentive for Attackers to control Mid to exert pressure throughout the map.\nWe closed off one side of Mid Pillar and tightened up Mid Cubby. As a result, Mid should be more comfortable to rotate through with more predictable threats.\nMid Pillar\nMid Cubby\nWe’ve adjusted B Site to make enemy positioning more predictable. This should make retake scenarios more manageable.\nB Site\nB Back\nHalls required a lot of attention from Defenders often forcing them to spread thin. By blocking it off we hope this allows Defenders to better focus on where threats will come from while allowing both teams to invest more resources across the rest of the map.\nA Hall\nWe expect there to be more fights in Mid and around Doors so we’ve adjusted this area to be more spacious and added a new stack of boxes as additional cover.\nMid Wood Doors\nCave added a lot of pressure to post plant situations and the split approach to A made it difficult for Defenders to confidently contest the space. These changes aim to make the main approach to A feel more neutral and less strong for post-plant.\nA Cave\nA Shop\nWe added a small platform at the bottom of each pyramid to make utility a bit easier to land around them. Also, we added signage to help differentiate callouts for the two pyramids.\nA Site"
  },
  {
    "title": "VALORANT Patch Notes 7.05",
    "patch": 7.05,
    "published": "2023-09-06",
    "final_content": "Hi, everyone. Jo-Ellen here.\nIt’s been a week—ready for Sunset in Competitive mode, yet?\nASTRA\nGoing in and out of Astral form is a complex mechanical task that leaves Astra vulnerable to attackers by denying her information about her surroundings. The change we’ve made to her Astral Form (X) gives Astra back some agency and information, allowing you to react to enemy footsteps and utility you may have missed while in Astral Form.\nSUNSET\nGENERAL\nAGENT\nPLAYER BEHAVIOR"
  },
  {
    "title": "VALORANT Patch Notes 7.06",
    "patch": 7.06,
    "published": "2023-09-19",
    "final_content": "Hey, all! Still Jo-Ellen here.\nThe biggest update for this patch is our change to who can queue with who in Competitive mode. As always, please give us your feedback. We’re always listening!"
  },
  {
    "title": "VALORANT Patch Notes 7.07",
    "patch": 7.07,
    "published": "2023-10-03",
    "final_content": "Hi, everyone! Jo-Ellen here.\nEpisode 7 Act 2 ends in just a couple of weeks, but we’ve still got Patch 7.07 until then. Below, you’ll find a Haven update, Performance update, and a few bug fixes.\nAnd again, we’re always listening to your feedback so please send it our way!\nAfter listening to your feedback, we have decided to remove the recent rank restriction made to 5 stacks that was implemented in Patch 7.06. We know how important it is to play with your friends and your need for flexibility in order to do that.\nInitially, the rank restriction was made to prevent people from illegitimately boosting to the highest ranks like Radiant. In the end, we realized that your ability to have flexibility with your 5 stack was more important than the very small number of people who abuse this exploit. However, we still recognize that boosting is a risk to competitive integrity and are working on an appropriate long term solution that doesn't impact your ability to play with friends in a 5 stack.\nIn Patch 7.06, we fixed a bug that allowed the game to output surround sound when certain conditions were met, but the surround mix was untested and unsupported. VALORANT currently only supports stereo and mono sound output."
  },
  {
    "title": "VALORANT Patch Notes 7.08",
    "patch": 7.08,
    "published": "2023-10-17",
    "final_content": "Hiya! Jo-Ellen here.\nWe’ve got some updates under the Agent Updates section regarding smoke visuals and ability equipping audio. Also, your Level Border and Player Card collections are going to look a little different. You can read about these and more below.\nAnd we always welcome your feedback so don’t hesitate to send it our way. Thank you!"
  },
  {
    "title": "VALORANT Patch Notes 7.09",
    "patch": 7.09,
    "published": "2023-10-31",
    "final_content": "What’s up? Jo-Ellen here.\nHappy last Act of the year and cheers to Iso’s release! Get out there and try out our newest Duelist (let us know what you think) and don’t forget: there’s a rank reset, fresh Battlepass, and a new Premier Stage.\nAside from all the new things released at the beginning of a new Act, we also have some Agent updates below.\nThis patch, we’re looking to address some issues in the balance of power between Sentinels, especially Cypher, and some other Agents on the roster. Sentinels often craft very deliberate setups only to have Agents like Raze, Skye, and Fade destroy them with typical utility use. In this patch, we’re updating Cypher’s Trapwire (C) to try to sway these interactions more in his favor, and to encourage enemy Agents to have to be more intentional and deliberate if they aim to use their utility to counter Sentinel setups.\nThese changes force attackers to actively destroy traps to break Cypher’s setups and push interactions with utility like Prowlers (C) and Trailblazer (Q) more in Cypher’s favor. In addition, the potency of the traps when they snag an enemy has been increased slightly to make sure opponents have to respect their threat.\nThese changes to Skye and Fade are meant to add more strategic depth to the placement of Cypher’s Trapwire.\nRaze will have to be more precise with her Paint Shells (E) in order to deal damage to enemies, including destroying enemy traps. Additionally, Raze will need to be more intentional in picking between using the Blast Pack (Q) for mobility or damage.\nWith the changes below, we’re sharpening the Judge’s identity as a hunker-down style shotgun by reducing some of its effectiveness while moving. With the reduced mag size, we’re hoping to create more opportunities for enemies to catch a person reloading their Judge as well as nudge the person with the Judge to be more efficient in order to get multi-kills.\nPremier Stage E7A3 is live with a few updates and new features! As always, good luck in your games!\nPremier Practice\nEnrollment Updates\nTimeouts\nPremier Crests\nPlayoff Qualification Threshold\nMatchmaking\nZones\nGeneral\nGameplay Systems"
  },
  {
    "title": "VALORANT Patch Notes 7.10",
    "patch": 7.1,
    "published": "2023-11-14",
    "final_content": "Hey, everyone! Jo-Ellen here.\nHow are you liking Iso so far? Have you won all your 1v1s against him (or as him)? Below, we’ve got changes for Jett’s Blade Storm (X) and Deadlock’s GravNet (C) as well as Team Deathmatch only changes to Fade and Reyna. As always, let us know what you think. Enjoy!\nGravNet (C) now requires anyone captured by it to manually remove the net in order to remove the effect. Before this, if you or the enemy were captured, you were able to remove it by moving out of the net radius or waiting for the effect to expire. We think this unlocks a unique power profile while making it a more interesting interaction on both sides, as enemies must put down their weapon and make a noise to deal with the debuff. In addition, we’ve made the ability more reliable for Deadlock to execute by increasing its radius while also ensuring that Agents like Jett and Raze can’t trivialize getting caught in it with their mobility."
  },
  {
    "title": "VALORANT Patch Notes 7.12",
    "patch": 7.12,
    "published": "2023-12-05",
    "final_content": "Howdy, all! Jo-Ellen here.\nIt’s the last patch for Episode 7 (and for 2023!). That means you’ve got a Battlepass to finish and some more ranks to climb before it all resets in the new year. But in the meantime, we’ve got Gekko and Skye updates, a new TDM map, and more below.\nGEKKO\nOne of Gekko’s unique strengths is being able to reclaim his creatures. This change aims to make that process faster so you can reclaim them in more situations. In addition, we’re also increasing the reliability of Dizzy (E) to increase Gekko’s confidence when using the ability and to provide more incentive for him to engage with its reclaim.\nSKYE\nThese changes are centered around pushing Skye to be more deliberate when using Trailblazer (Q):"
  },
  {
    "title": "VALORANT Patch Notes 8.0",
    "patch": 8.0,
    "published": "2024-01-09",
    "final_content": "Greetings, friends! Still Jo-Ellen here.\nWelcome to Episode 8 Act I and Patch 8.0. There’s lots in store in just the first patch of 2024 (Hello? New weapon?) so have at it and have fun. As always, send us your feedback—we’re always listening.\nThe Outlaw goes live!\nDeadlock\nContinuing in the direction of the previous 7.10 GravNet (C) changes, we’re looking to build upon the unique strengths of Deadlock’s two other basic abilities: Sonic Sensor (Q) and Barrier Mesh (E).\nKilljoy\nThe amount of coverage on Killjoy’s Turret (E) outshines other defensive recon tools when paired with the Turret’s other strengths, such as its autonomous detection and long range vision. Reducing its vision cone should push Killjoy to make clearer choices about what area of the map her Turret will cover, while the Turret’s updated visuals should aid you in quickly understanding what areas it will protect.\nDoors Refactor\nICEBOX\nIcebox is back with a few changes to shake up Mid, B Green and B Orange. Our goal with these changes is to add value and impact to Mid for either team controlling it and simplify pathing toward B Site through B Orange and B Green to make fights more predictable.\nAttacker Side Spawn\nB Green\nB Tube Exterior\nB Tube Interior\nB Snow Pile\nLOTUS\nAttackers have felt fairly overwhelming to Defenders on Lotus. Because of this, we’re adding more options by adjusting neutral spaces and making some quality of life updates across the map so that Defenders can better hold sites.\nA Main\nA Link\nA Hut\nB Site\nC Site\nC Bend\nRotating Doors\nB Orb\nTeam Deathmatch\nWe felt that the Sheriff is overperforming in the Stage 2 weapon ecosystem and, as a result, other loadouts have been pushed to the side. This change aims to allow other weapons to be more viable when in an engagement against a Sheriff.\nMap Rotation\nStarting in Patch 8.0, VALORANT will support third party spatialization software for headphones.\nSpatial Audio is virtual surround sound for headphones . This software processes sound to help you differentiate sounds that are in front, behind, or even above you, while listening on headphones. For example, figuring out if those footsteps were in front of you or behind you. We are excited to announce that Patch 8.0 will include official support for 3rd party spatial audio solutions! This gives you choices beyond the HRTF option which was already available in VALORANT’s audio settings. In Patch 7.06, we made changes to the audio engine that caused issues for those of you who were already using third party spatialization software, which we did not support at the time. When 3rd party spatialization software was active in Windows settings in 7.06, sound levels went haywire and our only solution at the time was to guide those being affected to turn third party spatialization software off for the time being. We implemented a stereo-only fix in 7.07 that was compatible with Spatial Audio, but did not allow it to virtualize surround sound. In Patch 8.0, the Speaker Configuration in VALORANT’s audio settings will default to stereo, but you can enjoy all of the features that these spatial audio solutions provide if you choose to opt in by setting the Speaker Configuration to Auto-Detect.\nHow can I experience Spatial Audio in VALORANT?\nHow can I turn off 3rd party spatialization?\nNote: Some peripherals are bundled with their hardware manufacturer’s spatialization software. It is possible to have this software activate spatial audio on your PC in a way that is not visible in the Sound control panel in Windows, only in the software itself.\nI already had 3rd party spatial audio software active, but in 8.0, gameplay sounds bad. How do I fix this?\nWhat about Virtual 7.1 USB headphones?\nI set VALORANT’s Speaker Configuration to Auto-Detect, but I didn’t activate Spatial Audio in my Windows settings. I’m listening to the game on USB headphones and now I don’t hear my own Agent’s VO or certain sounds that are emitting from directly in front of me or behind me. How can I fix this?\nI like the HRTF that was in the game before, can I still use it?\nWhat if I had HRTF enabled before, but I want to switch to trying another spatial audio software?\nI use Bluetooth headphones. When I turn spatialization software on, the audio glitches repeatedly. How can I fix this?\nWhat if I’m listening on speakers?\nIs mono still supported as an accessibility feature?\nI tried a 3rd party spatialization software format and it made me feel dizzy or nauseous. What’s up with that?\nDoes Spatial Audio affect competitive integrity?\nAudio playback methods compatible with HRTF and 3rd party spatialization:\nListening to\nCompatible with HRTF\nCompatible with Spatial Audio\nHeadphones\nYes\nYes\nSpeakers\nNo\nNo\nMono\nNo\nNo"
  },
  {
    "title": "VALORANT Patch Notes 8.01",
    "patch": 8.01,
    "published": "2024-01-23",
    "final_content": "Hey, friends! Jo-Ellen here.\nJanuary 2024 is almost over, but we’ve still got one more patch before we say goodbye to the first month of the new year. Below, you’ll see some Agent updates as well as one update to Breeze. Keep reading and I’ll see you all back in A Hall.\nOne last note: we’re always listening to your feedback so please let us know what you think.\nBREEZE\nIn the latter half of 2023, Skye became an increasingly dominant force within the Initiator role and began to clearly overshadow her peers in pick rate both in solo queue and coordinated play. Her core ability, Guiding Light (E), has been a main factor in her prominence, as it offers strong combat advantage, valuable recon and provided Skye with the only recharging flash amongst the Initiators. While we like Skye’s position having a mix of flash and recon and the diversity that can be brought to team comps, she’s lacked clear downsides to balance out this broad power.\nThese changes are centered around pushing Skye to be more intentional with Guiding Light (E). They should create a clearer opportunity cost when taking Skye in comps while also maintaining her uniquely powerful combination of combat advantage and recon within the Initiator role. We hope this update will land Skye in a spot where she is still viable in solo queue and coordinated play, but give room for other flash Agents to thrive. We'll be sure to keep a close eye to see if further changes are needed.\nIn the 6.07 patch, we removed the yellow warning indicators that appeared for people who were being chased by a close Seeker (X). We’re adding the indicators back in to make interactions with Seekers (X) more clear in chaotic engagements.\nWe’re updating Iso to push the agency and combat advantage that you get from Double Tap (E).\nWe’ve reduced the cost of Contingency to better reflect the value we see it generating in game.\nWith her Blast Pack (Q), Raze is often able to traverse a vast amount of space and suddenly become a threat to enemies. This audio update is meant to make it clearer when Raze is potentially Blast Packing (Q) into your area, especially when a lot of other action is going on at the same time.\nProjectile Jump Throw Normalization\nWe have implemented a feature to make jump throw lineup behavior more consistently reproducible. If you press the throw projectile input within 100 ms of jump start, the projectile will consistently have the same amount of velocity imparted from the thrower and as a result land consistently in the same location.\nMost existing jump throw lineups should still behave as they have in the past while being more consistent in output. In some cases, some minor adjustments may need to be made.\nHRTF\nHRTF will now be enabled if ticked and using Stereo speaker configuration.\nAGENTS\nGAMEPLAY SYSTEMS\nMAPS\nMODES\nPREMIER"
  },
  {
    "title": "VALORANT Patch Notes 8.02",
    "patch": 8.02,
    "published": "2024-02-06",
    "final_content": "Hi, everyone! Jo-Ellen here.\nWe’ve got a light patch this time around. Check out some Viper related updates as well as the Esports Hub coming back online for the 2024 VCT Season below.\nThe Esports Hub is back for all of VCT 2024 with new and improved features!"
  },
  {
    "title": "VALORANT Patch Notes 8.03",
    "patch": 8.03,
    "published": "2024-02-21",
    "final_content": "Hello, friends! Jo-Ellen here.\nWe’ve got some Chamber updates in this patch as well as new Breach voice lines, and more. As always let us know what you think. Enjoy.\nContinuing with our recent focus of sharpening the strengths and weaknesses of the Sentinel role, this update aims to push Chamber’s ability to hold territory with his unique arsenal of weapons. The changes should provide you with more access to the Headhunter (Q) as a save or sidearm without draining your econ, and increase the clear strength of Chamber’s ultimate compared to the Operator.\nTeams Tab\nEsports Store\nAgent\nCompetitive\nGameplay Systems\nMaps\nPremier"
  },
  {
    "title": "VALORANT Patch Notes 8.04",
    "patch": 8.04,
    "published": "2024-03-05",
    "final_content": "Hi, everyone! Alice here, and welcome to Episode 8 Act 2! This patch we’ve got some updates to Premier just in time for the next Stage, so grab your squad and queue up! We also have some bug fixes across the board, including one to fix KAY/O’s ZERO/point (E), sometimes reporting inaccurate information.\nA new Stage of Premier starts! Here’s what’s new:\nMasters Madrid is right around the corner, and we have a few updates for the Esports Hub:"
  },
  {
    "title": "VALORANT Patch Notes 8.05",
    "patch": 8.05,
    "published": "2024-03-26",
    "final_content": "Hi, everyone! Alice here with some more patch notes.\nThis patch we’re releasing a brand new Agent, Clove. They’re the latest Controller to join our roster and hail from Scotland. We’re excited to see you all play them today, and also can’t wait to hear what you think of them, so be sure to let us know.\nWe also have a small update to Premier, voice indicators, and a few bug fixes. Welcome to Patch 8.05 and we hope you have fun defying death."
  },
  {
    "title": "VALORANT Patch Notes 8.07",
    "patch": 8.07,
    "published": "2024-04-16",
    "final_content": "Hey, friends! Jo-Ellen here. Nice to see you again.\nThere’s not much time left in Act II so better make the most of it. Below, we’ve got an update to Omen, lots of Clove bug fixes, and more."
  },
  {
    "title": "VALORANT Patch Notes 8.08",
    "patch": 8.08,
    "published": "2024-04-30",
    "final_content": "Hi, friends. Jo-Ellen here.\nIs it really almost time to say goodbye to Episode 8? Not quite. We still have plenty in store for the last Act. Check out the Viper and Cypher updates below. Also, new Act, new Stage of Premier.\nChamber\nCypher\nSince his updates in 7.09, we’ve been excited to see Cypher solidify a stronger spot on the Sentinel roster, but feel it’s pushed his stalling power further than we’d like for an Agent that specializes in global information. Additionally, we’ve seen play patterns around Spycam (E) that lack counterplay for the enemy team.\nViper\nAs you have continued to improve leveraging Viper’s strengths, she’s grown into a dominant meta force and constant presence in pro play. With this update, we hope to solidify clear weaknesses that Viper has compared to her peers while still maintaining her unique identity as a Controller / Sentinel hybrid. You should feel that Viper has to commit to her positions and manage shorter individual up times per smoke use with her unique ability to control her smoke over time.\nWe messaged this out on socials but want to call out again that in 7.09 we unintentionally shipped some number changes to Viper’s fuel. For full visibility, you’ll see three numbers in some of the changes listed below: First will be before 7.09, second after 7.09, and the final is the update for 8.08.\nA new Stage of Premier starts! With this one, we’re adding promotion."
  },
  {
    "title": "VALORANT Patch Notes 8.09",
    "patch": 8.09,
    "published": "2024-05-14",
    "final_content": "Howdy, y’all. Jo-Ellen here with Patch Notes 8.09.\nIt’s a short one this week as we prepare for bigger things in the near future.\nAs Brimstone likes to say: \"I can't close the settings menu on my bracer. How do I—oh, got it.\"\nBrimstone\nGameplay Systems"
  },
  {
    "title": "VALORANT Patch Notes 8.10",
    "patch": 8.1,
    "published": "2024-05-29",
    "final_content": "What’s up, gamers. Jo-Ellen here.\nMajor update for this patch: our Basic Training Event. Read more about it below.\nIf anyone in your match is actioned on, you'll receive a notice when they are penalized, even if you didn't report them yourself. Please note that we already have reporter feedback, but this just expands the scope of who receives messages.\nBasic Training Event\nWe are releasing an update to our Welcome Contract for new players! The new structure includes clearer missions and milestones to help you navigate the New Player Experience with a bit more guidance before your Ranked climb.\nThe Basic Training Event will appear similar to other Events, allowing you to view your progress, understand your goals at each milestone, and complete them to earn rewards to jumpstart your VALORANT experience.\nIf you have previously completed the Welcome Contract, you will not see the Basic Training Event (don’t worry, you have already earned all the same rewards!).\nIf you are partially complete with the Welcome Contract, your previously earned rewards will be reflected in the Basic Training Event when it comes online, and you will be able to proceed through Basic Training, earning XP toward your Battlepass.\nAgent\nFixed an issue where shots fired immediately after exiting Cypher’s Spycam (E) would bypass the weapon’s raise animation and not deal damage. The weapon raise animation is now played for its full duration.\nFixed issues where the timer for Clove’s Pick-Me-Up (C) could be restarted which would allow Clove to have more time than intended to activate the ability."
  },
  {
    "title": "VALORANT Patch Notes 8.11",
    "patch": 8.11,
    "published": "2024-06-11",
    "final_content": "Hi friends! Alice here with Patch 8.11, and this one is a bigger one. We’ve got some updates to some Duelists, these are the same that we shared last week. We also have a new map rotation, and a new map, Abyss… just make sure to watch your step. Additionally this will be the first patch our new friends on console will get to enjoy, we have some new features for them, and are excited to welcome them into our community!\nWe can’t wait to see your clips on Abyss (please show us your creative ways of knocking someone off, we’ve been dying to see them since we started developing this map), and hear your overall feedback for this patch, so please send it our way. Good luck in your matches and enjoy Patch 8.11.\nFor some context, this update is aimed to allow other Duelists to compete with Agents like Jett and Raze that excel at taking space for their team through sheer speed and mobility. These changes provide more ability for Duelists to take space for their team, and to be the tip of the spear through their own unique play styles—whether it's stronger pure dueling ability like Iso, a mixture of speed and evasion in combat like Neon, or Reyna's blend of being able to recover and escape from combat.\nIso is receiving strictly buffs this patch because he’s underperforming across all skill brackets. Leaning into increasing Iso’s signature ability output is intended to make Iso more reliable at challenging contested spaces and winning opening duels by granting his shield immediately after channeling the ability. Iso’s buff will also remain active and orbs will still spawn should he lose his shield and secure a kill during Double Tap’s uptime. Shooting the orbs will refresh the duration of the buff and the shield.\nDouble Tap (E)\nIso now grants himself a shield upon finishing a 1 second animation during which he can’t use his gun.\nThis plays a shield forming sound at the end of the channel when the shield is activated.\nCharges 2 >>> 1\nKill reset added to Double Tap (Iso gets a charge back if he gets 2 kills).\nIso now receives a Wall Penetration tag instead of a standard Heavy Penetration tag when the shield is broken. This means he’s slowed less upon his shield breaking.\nAdditionally, Iso now gets a damage indicator towards the direction of the enemy that broke the shield\nIso can now recast Double Tap while it’s active to refresh the duration of the shield.\nThis is relevant if he gets a refreshed charge of his Double Tap from getting 2 kills.\nWe want to sharpen Neon as an Agent who excels at taking mobile fights directly to her opponents by buffing the unique value she brings to the table. We’ve made her slide more effective at sliding directly into opponents by making it more combat-ready, and by removing all weapon movement error when sliding as well as a few other changes. The updates to her Fast Lane (C) are intended to make fights around her wall dropping feel more intuitive for Neon’s allies while reducing the visual noise it creates in game.\nSharpening her Relay Bolt (Q) to be a more premium and reliable one-charge ability is intended to allow Neon to have more success when she does decide to commit to a fight with her slide, as well as make some room for the second slide charge.\nFast Lane (C)\nFast Lane (C) dissipates from behind to minimize visual noise in combat space while giving cover for Neon.\nFast Lane’s (C) audio has been updated to travel with the fade out of the wall.\nWall Duration 6s >>> 4s\nWall Dissolve Duration 1s >>> 2s\nHigh Gear (E)\nSprint\nNeon no longer has her strafe speed reduced while sprinting.\nMax Sprint Speed while moving sideways 6.73 meters/second >>> 9.11 meters/second\nTime until Full Fuel Regen 60s >>> 20s\nSlide\nSlide charges 1 >>> 2\nNeon now removes all weapon movement error when sliding.\nThis effectively means she’s more accurate while sliding.\nSecond Slide Cost: 150\nEquips out of slide: Fast >>> Instant\nSlide equip buffer >>> .2s (after sliding, there is .2 seconds before her gun comes out)\nRelay Bolt (Q)\nCharges 2 >>> 1\nWindup delay 1.1s >>> .8s\nConcuss Duration 3.0s >>> 3.5s\nReyna is receiving both buffs and nerfs this patch to reshape the power of her kit. The goal of the changes is to reduce the level of dominance she can achieve in Ranked, especially at low and mid ranks when outperforming her enemies, while pushing some of her value in coordinated settings:\nHealing has proven very strong statistically in Ranked with higher impact at low and mid ranks. This change should reduce her ability to snowball round-over-round in these settings.\nRemoving the time restrictions on her Devour (Q) and Empress (X) should allow you more flexibility to play at your team’s pace and increase the baseline value of both in coordinated play where rounds play out slower.\nDismiss (E) has been re-tuned to provide a greater movement speed boost, but has a shorter duration. This should reward decisive and skillful Reyna players by unlocking faster and more powerful combat repositioning.\nWe’ll be tracking how these updates affect Reyna across all the different skill levels and settings of play.\nDevour (Q)\nHealing decreased 100 >>> 50\nFull heal time reduced from 3s >>> 2s\nOverheal of armor no longer decays after a timer.\nDismiss (E)\nTop speed increased 9.1 meters/second >>> 12 meters/second\nTotal duration of Dismiss reduced from 2s >>> 1.5s\nEmpress (X)\nEmpress no longer has a timer and is permanent until Reyna is killed or the round ends.\nAs we’ve seen you get better and better at Raze’s satchel mobility, we’ve found that her total speed and movement potential can undermine the tactical loop. These changes are intended to allow you to more reasonably counterplay Raze, whether through your own utility or gunplay. While we still want to maintain the sandbox movement fantasy of Raze’s satchels, she should not be as surprising when not supported by allied utility.\nBlast Pack (Q)\nRaze’s satchels no longer explode for damage/knockback upon opponent destruction.\nRaze’s horizontal velocity when satcheling has been slowed.\nSatchel explosion audio has been updated to be audible farther away to ensure enemies can hear the first satchel when a Raze double satchels.\nWhile we’re excited with how Clove has been immediately relevant in Ranked and how much you’re enjoying playing them, their performance in ranked play is stronger than we’d like. We’re trimming some extraneous power from their selfish, Duelist-oriented outputs while preserving the Controller-leaning power in their kit.\nPick-Me-Up (C)\nCost 100 >>> 200\nDuration 10s >>> 8s\nDamaging Assist Time to activate 10s >>> 6s\nNot Dead Yet (X)\nCost 7 >>> 8\nUnequip Delay .7 >>> .8s\nBUG FIX: Clove’s ultimate will no longer survive the fighting state if they get a smoke assist.\nWe’ve also added a new VO line for Omen and for Clove when starting a match on Abyss.\nPC\nEsports Hub Team Page Improvements\nWe’ve added roles to our roster information to help differentiate between players, substitutes, and coaches.\nWe’ve added blurbs highlighting the personality and accomplishments for teams in VCT Americas and VCT Pacific, with more on the way!\nRadio Command Wheels\nWith player-to-player communications being so vital to the core game loop of VALORANT, we’ve taken the opportunity to improve our Radio Command Wheels to include more relevant call-outs, a higher variety of pings and Agent VO, and brand new Wheels to extend player communication across more phases of the round. We’ve also removed some less useful commands to make the wheels as quick and easy to use as possible while making sure the most important commands are easy to access.\nThese changes add specificity & clarity to the existing communication tools and add new ways for teammates to strategize and communicate:\nNew Strategy Wheels during the Buy Phase\nUnique Strategy Wheels for Attackers and Defenders\nNew Commands Wheel on the Megamap\nUpdated options on existing Command Wheels\nUpdated VO on existing Commands Menu (PC only)\nStreamlined Wheels to feature our most important command options\nNew Player Tips\nAs you join our community and complete the tutorial and start sharpening your skills on the battlefield, we want to make sure you are armed with the right information to succeed and secure that clutch! So, we’ve implemented a \"New Player Tip\" system that will display useful in-game information based on the actions you take during the match. These tips will provide critical information for gameplay fundamentals, potential focuses for skill improvements, and suggestions for advanced strategies.\nOur New Player Tips have been built from the ground up for Console Limited Beta to give you more opportunities to skill-up and learn VALORANT faster via:\nTips that 'listen' to your in-match actions and behaviors\nTips that level up with you as you learn the fundamentals of VALORANT gameplay, from beginner to advanced strategies\nIf you’re a returning player, New Player Tips won't show up, since you already have a good grasp of the fundamentals. If they do pop up, and you’d like them to stop, you can always switch them off in Settings\nNEW MAP: ABYSS\nA 5v5 spike mode map that provides thrilling danger with its precarious pitfalls (watch your step) and vertical gameplay. ABYSS is the first VALORANT map that has no boundaries and takes place in the secret hidden fortress of the Scions of the Hourglass.\nAbyss is our newest map and features three lanes and two sites.\nMAP POOL UPDATES\nPlease note, there are significant map pool updates in the 8.11 patch. In addition to a brand new map entering the rotation, we have made the following changes.\nStarting in patch 8.11, Competitive, Deathmatch, & Premier queues will contain ASCENT, BIND, ICEBOX, LOTUS, SUNSET, and HAVEN (returning).\nABYSS will enter the competitive pool in patch 9.0.\nABYSS will enter the premier pool in patch 9.02.\nBREEZE and SPLIT have been removed from the above map pools.\nStage E8A3 playoffs for Premier will have the E8A3 map pool: BIND, LOTUS, ASCENT, SUNSET, BREEZE, SPLIT, and ICEBOX.\nWeek 6 of Premier will still be played on SPLIT.\nStarting in patch 8.11, Unrated, Swift Play, Spike Rush, & Escalation will move to an OPEN map pool. All maps (including ABYSS) will be available in these queues.\nPlease continue to share feedback as we work through improving the map pool experience. And keep an eye out, because we’ll be sharing more about map pools in the future!\nCONSOLE MAP POOLS\nNew console players will have access to a limited number of maps for beta launch. We know there’s a lot to learn when you’re new to VALORANT, so we’re limiting the map pool to allow players who are queuing up for the first time have an easier time learning core mechanics and map layouts.\nThe initial map pool for console will include ABYSS, ASCENT, BIND, and HAVEN\nA new map will be added on every patch starting with 9.0\nThere will also be a limited number of modes queues for console Beta (please see “mode updates” section)\nAll Team Deathmatch maps will be available for console beta\nAll 11 VALORANT spike mode maps will be available in custom game mode.\nOPEN RANGE\nThe open range has been updated for console beta\nVarious visual updates to the environment\nVisual updates to in-world UI panels (bot shooting range & practice target)\nPractice target has moved to a new location\nPortal & playable mini training modules have been removed from the environment\nABYSS QUEUE (PC ONLY)\nPlease note that the Abyss Only queue will only be live for one week.\nAbyss Only games will use the Unrated mode format.\nCONSOLE MODE QUEUES\nConsole players will have access to a limited number of modes for the Limited Beta launch.\nConsole Limited Beta players will have access to:\nUnrated\nSwift Play\nDeathmatch\nTeam Deathmatch\nCustom Games\nCompetitive mode will go live for console players in patch 9.0\nNEW BASIC TRAINING TUTORIAL (CONSOLE ONLY)\nThe in-game tutorial has been updated for console launch! All players queuing up on Console will auto-load into a new training experience that goes over the basics of VALORANT gameplay (shooting mechanics, agent abilities, match format, and more!)\nNEW BOT TRAINING MATCH (CONSOLE ONLY)\nThere is an OPTIONAL bot match for new players who want to warm up with AI controlled bots and teammates. This special match is meant for new players that want to apply what they just learned in the basic training tutorial.\nThe bot training match is a full Swift Play match on Haven.\nNEW PRACTICE OPTIONS (CONSOLE ONLY)\nThe practice menu has been updated for console launch\nOpen Range (will spawn player directly in front of the bot shooting range)\nReplay Tutorial (ability to replay new tutorial experience)\nRemoved old training modules from practice menu\nNote: All new training content will be coming to PC on a later patch.\nWe’ve updated our threading behavior to improve performance on 2-core machines. This will result in better in-game performance for and shorter loading times.\nIn Patch 8.11, we will be implementing an intermediate change to mitigate an exploit around remakes. Previously, matches that ended in a remake weren't being acted upon appropriately by our systems allowing players to attempt repeated remakes without seeing any enforcement. Now, we’ve increased the intervention severity for AFKs resulting in a remade match. This means players will immediately encounter an intervention in this scenario, which will increase through repeated occurrences. We're still exploring this space, so please keep providing us with your feedback.\nWe’ve updated the friends list to display VALORANT console players. This means any of your Riot friends who are playing on console will appear under “other games” in your friends list.\nWe’ve changed the default behavior of voice chat to prioritize team voice. Now when you connect to a team voice channel, you will automatically be speaking to your whole team, not just party members.\nAfter playoffs on June 23, teams that performed well enough will get promotion notifications!\nIf you’re in Open - Elite Divisions, win your playoff bracket and you’ll see a notification when you return to the Premier hub.\nIf you’re in the Contender Division, finish in the top 32 teams and you’ll see a notification the first time you visit the Premier hub after the standings finalization time.\nIf you’re on a team that earned a promotion, your division icon on the Premier hub and Premier Team page will have a promotion indicator for the rest of Stage E8A3.\nIf you’re in Open - Elite Divisions, you’ll be placed at least one division higher at the start of Stage E9A1.\nIf you’re in the Contender Division, you’ll be placed into the new Invite Division, where you’ll compete for an opportunity to make it into a Challengers League.\nThe Store has had a visual update to increase clarity and quality of the buy phase experience.\nAlly utility is now visible on team member slots for easier strategization.\nRemaining armor is now visualized as a fill in the UI.\nHolistically added animations to increase clarity around affordability, requesting and weapon purchases.\nItem states have gone through a visual pass to improve readability.\nAgent\nALL PLATFORMS\nFixed an exploit where players could stand on Killjoy’s Turret (E) when it was wedged into a corner. Players in this situation will now have inaccurate gunfire similar to if they were jumping.\nFixed issues where Clove could play the incorrect animation or slide along the ground during a skin finisher if they were the last player alive and had their ultimate available.\nFixed an issue where players inside Clove’s smoke forming location were at a disadvantage compared to players on the outside of the smoke.\nFixed an issue where Clove’s Pick-Me-Up (C) could not proc on training range bots\nFixed an issue where Clove’s Not Dead Yet (X) allowed smoke assists to allow them to survive\nGameplay Systems\nFixed an issue with Brimstone Incendiary (Q) VFX not appearing unless the player is observing the direction it is coming from\nFixed some issues with Combat Report Player Info not populating properly with information on death\nFixed bullet tracers still being visible after being turned off in settings when player fires at certain angles away from the map\nFixed issues where agent abilities that attach to walls can be shot through impenetrable surfaces\nFixed tooltips not updating after rebinding while an agent ability is equipped\nFixed Arabic language format errors when using Gekko Wingman (Q) or picking up a Weapon\nFixed longer crosshair profile names extending the Delete/Duplicate Profile popup in settings\nPremier\nPC ONLY\nFixed a bug where the green arrow indicator for the Choose Side selection in map pick and bans didn’t show up"
  },
  {
    "title": "VALORANT Patch Notes 9.0",
    "patch": 9.0,
    "published": "2024-06-25",
    "final_content": "Hey, friends. Jo-Ellen, here.\nSay hello to Episode 9 and its very first patch. There's a lot.\nYou'll see an update to Iso's Double Tap as well as Abyss entering Ranked on PC.\nWe've added new conversation voice lines between Agents that includes: Phoenix, Harbor, Brimstone, Yoru, Raze, Iso, Sage, Neon, Gekko, Skye, Deadlock, Omen, Kayo, and Reyna.\nIso\nWe're happy that Iso has been more comfortable entry-ing towards the front of his team but want to increase thoughtfulness and context around when Iso activates his Double Tap . This should make the counterplay around breaking his shield or denying the Double Tap orbs more successful.\nSo we're decreasing the duration of his Double Tap buff while also removing the refresh that comes with securing two kills. Iso can now only extend Double Tap by shooting the orbs that spawn while the buff is active.\nDouble Tap (E) : Duration: 20s >>> 12s\nSignature kill reset removed\nSova's Owl Drone's HP is now 100, up from 60.\nAbyss added to the Ranked map pool.\nCompetitive Mode is coming to Console this patch! Queue up and see if you can climb the ranks and make it onto the Immortal Leaderboards. Good luck on your first race to Radiant!\nOur Competitive Mode map pool will start with Abyss, Ascent, Bind, Haven, and Sunset with new maps slowly being added in the next few patches.\nAdded a new \"Controls Preset\" selection screen upon first boot-up prior to loading into the tutorial\nYou can now choose between our VALORANT-specific controls preset or a more familiar, TRADITIONAL console FPS preset as your starting controls scheme.\nYou can easily change your preset and customize controls at any point once in-game through the Settings menu.\nPolished sound transitions between Focus and ADS to better reflect the aim state you're transitioning into.\nCrosshair presets have been updated to reflect a better variety of usable crosshairs.\nUpdated the Fighter controls preset so that Crouch is a Hold action instead of a Toggle action.\nAdded holistic Aim Sensitivity slider.\nAdded the ability to enter precision mode while in controls settings to adjust sensitivity sliders by .1 increments.\nIn addition to removing zero tolerance terms from text chat, people who repeatedly engage in this behavior will see increased penalties on their transgressions.\nWelcome to the Path to Pro!\nTeams in Contender that earned a promotion in Stage E8A3 are in the new Invite Division, where finishing the Stage at a high enough rank will earn you an opportunity to make it into a Challengers League.\nContender and Invite Divisions play a little differently:\nStrict rematch protection in weekly matches prevents you from ever matching against the same team more than once in a Stage.\nIf we can't find you an appropriate match during the queue window, you'll be given a Bye. Byes award a match win and 100 points.\nLosses award 0 points.\nFinals in playoffs are Best of 3 matchups.\nThere are some extra roster restrictions for Contender and Invite Division teams.\nFor all the details on new rules in Contender and Invite, check out our updated Everything You Need to Know About Premier article .\nWhen you add a friend, you can now paste or type a full Riot ID (including tagline) into the \"Riot ID\" field and it will automatically split the data into the \"Riot ID\" and \"tagline\" fields.\nWe've updated the communications menu so it's easier to manage team and party voice on the fly.\nWe've added Voice Chat to the Settings page. Now you can tailor your mic behavior and voice settings to suit your setup.\nAgent\nPC\nFixed an issue where Iso's shield hitbox could be misaligned.\nCONSOLE\nFixed an issue with Jett's Tailwind (diagonal dash) that was reducing the dash length.\nCompetitive Systems\nCONSOLE\nFixed an issue in Team Deathmatch where you would incorrectly see DRAW as a final result in EOG screens\nAdded specific scoreboard screens for Team Deathmatch and Deathmatch\nGameplay Systems\nALL PLATFORMS\nFixed a particle issue when using ADS on the Level 3 and 4 Mystbloom collection.\nFixed an issue when exiting Cypher's Spycam that caused Cypher's hands to stutter for Spectators.\nCONSOLE\nFixed issue where both Focus and ADS sounds would play during transitions.\nFixed Leave Game menu persisting through AFK idling.\nFixed animation bug with Leave Game Menu.\nMaps\nABYSS\nFixed several unintended boost positions.\nFixed bugs allowing players to get under the map.\nA Site cover should now properly appear in Omen and Astra smoke targeting world.\nFixed an Omen exploit allowing him to get between the spawn barriers.\nSocial\nCONSOLE\nFixed an issue where the friends list would sometimes display inaccurate platform information for friends.\nGeneral\nCONSOLE\nWhen navigating Surrender menus, there's a chance your controls can become locked for an entire round. Due to this, we've elected to disable the Surrender and Remake menus until we can properly fix the issue. Draw will remain functional.\nPremier\nPC\nWhen changing the Stage in the dropdown on the standings page, the content doesn't refresh. To see accurate standings for past Stages, change the Stage, then change division or zone and the content will update.\nThe standings page sometimes fails to update, and you may see fewer teams than expected. Click on another tab in the Premier Hub and then return to standings to fix the issue.\nIf you are in Contender or Invite and are awarded a Bye during Weekly matches, you will not see that match recorded in their Premier Match History tab. You will be awarded a win and 100 Premier Score as expected, and that is reflected correctly on the standings."
  },
  {
    "title": "VALORANT Patch Notes 9.03",
    "patch": 9.03,
    "published": "2024-08-13",
    "final_content": "Hey folks! I’m Ash and I’m a new Community Manager on the team. Don’t worry, Jo-Ellen is still here – I’ll be helping her out with patch notes from now on so you’ll see me from time to time. I’m excited to start sharing game updates with y’all so let’s get right to it with Patch Notes 9.03.\nWe’ve made improvements to ground spreading abilities and added a preview to Sage’s Barrier Orb so the placement preview now also shows up on the minimap. Additionally, Pearl is entering Unrated and Swift Play queues on Console.\nHope everyone has been enjoying VALORANT on Console so far!\nMade improvements to how overlapping interactable objects work. You should now perform the desired action more consistently.\nFor Example: A dart from Cypher’s Spycam should no longer prevent you from attaching to a rope if you’re directly looking at it.\nGround Spreading Abilities\nWe're making improvements to abilities that spread along the ground like Brimstone’s Incendiary and Viper's Snakebite . Previously, these abilities had inconsistent effects depending on the exact location they landed, ranging from extremely different sizes or damaging through walls and in areas the ability wasn’t visually present. With this update, these abilities should spread more consistently and only apply damage in places that are consistent with the visuals.\nMap Targeted Abilities Improvements\nYou can now ping and see additional icons on maps used for ability targeting\nAffected abilities: Brimstone’s Sky Smoke and Orbital Strike , Clove’s Ruse , and Omen’s From The Shadows\nSage’s Barrier Orb\nBarrier Orb’s placement preview now also shows up on the minimap\nImproved the performance of Iso’s Kill Contract ability.\nGeneral\nFixed issue where opening menus would reset your toggle crouch / toggle walk state.\nGameplay Systems\nFixed a bug where pinging guns on the ground was not displaying the gun's name in the text feed.\nFixed a rare bug that resulted in the defuse timer showing up as ‘-00.00’ if the Spike was defused as the round timer hit 0.\nFixed an issue with Ability icons not appearing on the minimap as an Observer.\nFixed an issue where in certain scenarios, you can see an enemy but they don’t appear on the minimap.\nFixed an issue where \"DAMAGE TO YOU/YOU DEALT\" is overlapping the Combat Report widget.\nFixed font size readability issues with Combat Report in certain languages.\nFixed an issue with auto re-scoping for Outlaw, Marshall, Operator staying active while the gun goes through a reload.\nMaps\nAbyss\nFixed a spot in Mid Library where thrown abilities can clip through the shelves into gameplay space.\nFixed a spot where Agent utility could be thrown off the map and used as a platform.\nRevised the message from the Scions of the Hourglass to fix text errors.\nFixed a minor visual issue for the railings around Defender Spawn.\nThe Range\nFixed a bug where certain words in the Range were not being translated correctly into various languages.\nClient\nCombat Report\nFixed a bug where during pre-round, [Tab] must be held down while pressing the cursor toggle button to enable the cursor.\nPearl enters Unrated & Swift Play queues.\nGeneral\nFixed issue where opening an Ability map and the Shop/Scoreboard simultaneously could result in a loss of input.\nFixed an issue where pressing an Ability button while defusing the Spike would equip a weapon.\nAgents\nHarbor\nFixed an issue where Harbor’s High Tide wall would end prematurely."
  },
  {
    "title": "VALORANT Patch Notes 9.04",
    "patch": 9.04,
    "published": "2024-08-27",
    "final_content": "Hey folks! It’s Ash back again with Patch Notes 9.04. Thanks for the warm welcome last time!\nWe’re adding a new Agent to our roster, Vyse. She’s a Sentinel with a unique kit that will surely make you hesitate before stomping onto a site. I recommend heading to the Range to work on your pistol game since you’ll be using it more when going against her!\nAdditionally, Split is entering Unrated and Swift Play queues on Console, and we’ve fixed quite a few bugs. Let us know what you think about the update and we’ll see you on the battlefield!\nThe Unlimited Abilities cheat will now add 100% fuel and remove any fuel consumption from Neon's High Gear , Skye's Regrowth , and Viper's Toxic Screen and Poison Cloud\nVyse goes live!\nVyse will be released to regions in a staggered rollout starting from 8/28 at 1 PM PT .\nAbilities:\nArc Rose: EQUIP an Arc Rose. Target a surface and FIRE to place a stealthed Arc Rose, or ALT Fire to place the Arc Rose through it. REUSE to blind all players looking at it. This ability can be picked up to be REDEPLOYED.\nShear: EQUIP filaments of liquid metal. FIRE to place a hidden wall trap. When an enemy crosses, an indestructible wall bursts from the ground behind them. The wall lasts for a brief time before dissipating.\nRazorvine: EQUIP a nest of liquid metal. FIRE to launch. Upon landing, the nest becomes invisible. When ACTIVATED, it sprawls out into a large razorvine nest which slows and damages all players who move through it.\nSteel Garden: EQUIP a bramble of liquid metal. FIRE to send the metal erupting from you as a torrent of metal thorns, JAMMING enemy primary weapons after a brief windup.\nWatch our newest Sentinel disarm her enemies below.\nWe will be issuing a behavioral manual evaluation to players who have a pattern of engaging in comms abuse in order to create a healthier comms experience in VALORANT.\nAgent\nSkye\nSeekers\nFixed an issue where Seekers would not consume Ultimate Points under certain conditions.\nNeon\nHigh Gear\nFixed an issue where Neon could slide into the barrier at the beginning of a round and get a free slide charge.\nNOTE: This was fixed in 9.02, but we forgot to patch note it. Thanks Reddit user BhatsterYT!\nKAY/O\nFlash/Drive\nFixed an issue with Flash/Drive showing a second explosion if it is thrown behind a wall.\nGameplay Systems\nCombat Report\nFixed an issue where spike icons would not show on the combat report when killed by spike explosion damage.\nFixed a minimap issue where parts of the minimap were not covered by Nearsight abilities if the player leaves the area they were affected in (such as using the Bind teleporters).\nFixed an issue where the scoreboard would show a white box icon on a disconnected player if they disconnected from the game.\nMaps\nAbyss\nFixed several areas around Mid and A Site to prevent agent abilities from going through walls.\nUpdated the pre-round barriers around the edges of the map to be more visible.\nUpdated an area around B Main to prevent agents camping spots out of bounds.\nIcebox\nFixed a geometry gap in A Main.\nLotus\nFixed a visual issue where agents were floating next to the rope when using the ascender line.\nNew Player Tutorial\nAdjusted and fixed lighting around the New Player Experience Haven level.\nAgents\nSova\nSova’s Hunter’s Fury does not always play the minimum blind effect on opponents when the damage lands. This will be fixed in patch 9.05.\nAdjusted tactical timeouts rules in Premier and Tournament Mode Custom Games\nTeams now have 2 tactical timeouts that they can call at any time\nPreviously, teams could call 1 tactical timeout per half\nIf the game goes into OT, each team is given 1 additional tactical timeout.\nCombat Report\nPressing M3 now will open up the additional details panel of the combat report (previously Tab+M3).\nPremier\nFixed an issue where the schedule would sometimes scroll inconsistently when collapsing/expanding weeks\nSova\nHunter’s Fury\nThere are now reduced spikes in rotational speed after firing each shot of Hunter’s Fury.\nAstra\nCosmic Divide\nCosmic Divide’s wall placement now prioritizes player input, allowing you to better control the placement of the ability.\nNEW MAP! “Split” enters Unrated & Swift Play queues.\nWe added the Season Dropdown to your Act Rank and Leaderboard pages so you can check out your previous Act Rank History.\nGeneral\nFixed an issue that could cause you to be unable to swap to your Primary or Secondary weapon on the Traditional Control preset.\nFixed an issue where the ability bar icons would be misaligned when unbound.\nFixed an issue where incorrect text prompts could appear during a surrender vote.\nFixed an issue where D-Pad and Stick inputs could change toggleable settings.\nCompetitive\nFixed an issue where sometimes ranked updates in Match History page do not display.\nFixed an issue where viewing players on the Leaderboard would display a missing player card\nFixed an issue where side elements in the Leaderboard page could not be navigated to after leaving a game.\nFixed an issue where an observer would see an empty summary screen after finishing a custom game.\nFixed an issue where the last match when viewing a friend's career would be incorrect\nGameplay Systems\nCombat Report\nFixed an issue with Combat Reports flickering after respawning in Team Deathmatch.\nFixed an issue with Combat Reports overlapping with the Victory/Defeat ceremony if the player is dead at the final round.\nFixed a bug with Combat Reports not showing up after force closing the game and reconnecting to the match.\nVyse\nVyse’s damaging abilities display incorrectly in the Combat Report.\nGameplay Systems\nSurrender Voting\nYou can close the voting notification popup by pressing the Circle / B button. This will result in you not being able to participate in a vote, and you will eventually default to a ‘no’ vote after timing out.\nButton icons appear in the bottom right corner of the screen while the voting popup is active. These can block some other UI elements until voting ends."
  },
  {
    "title": "VALORANT Patch Notes 9.05",
    "patch": 9.05,
    "published": "2024-09-10",
    "final_content": "Hey, friends. It's me again, Jo-Ellen. How've you been?\nBelow we've got Patch Notes 9.05. What's in it? Glad you asked. We've got updates to a few Agents including Astra now getting 5 stars and Chamber's Rendezvous having its radius increased. There are some Player Behavior updates for all platforms and one for just PC. Breeze is coming to Unrated and Swift Play on console. Console is also getting an updated Progression screen.\nAnd at the very bottom, you can check out the schedule for the rest of the patches coming out in Episode 9, but please note that these are Pacific times and that the patch will have a staggered roll out to all regions starting on those dates.\nOmen\nChamber\nAstra\nStim Behavior\nAres\nThese changes aim to make headshot damage more consistent with competitors and to encourage its capability at holding down a location against multiple enemies.\nClient\nMaps\nGeneral\nAgents\nPlease note that Patch dates can change due to a number of different reasons.\nPatch\nScheduled Date (Pacific Time)\n9.06\nSeptember 24, 2024\n9.07\nOctober 8, 2024\n9.08\nOctober 22, 2024\n9.09\nNovember 5, 2024\n9.10\nNovember 19, 2024\n9.11\nDecember 10, 2024"
  },
  {
    "title": "VALORANT Patch Notes 9.07",
    "patch": 9.07,
    "published": "2024-10-08",
    "final_content": "Hi folks! It’s Ashley and I’m back to talk about Patch 9.07.\nWe’ve made a few updates to Astra’s Cosmic Divide and Cypher’s Spycam, fixed various bugs, and added new text and visual descriptions for Aim Curve settings options to Console.\nGood luck in your comp games and I’ll see you next time!\nAGENT UPDATES\nPROGRESSION UPDATES\nBUG FIXES\nAgents\nPREMIER UPDATES\nBUG FIXES\nCOMPETITIVE UPDATES\nKNOWN ISSUES\nPREMIER UPDATES\nGENERAL UPDATES\nCOMPETITIVE UPDATES\nBUG FIXES\nCOMPETITIVE UPDATES\nFixed an issue you would see the option to enable and disable your own act rank when viewing a friend’s career\nKNOWN ISSUES\nPLAYER BEHAVIOR UPDATES"
  },
  {
    "title": "VALORANT Patch Notes 9.08",
    "patch": 9.08,
    "published": "2024-10-22",
    "final_content": "Welcome to the start of Episode 9 Act III. Let’s get into it.\nThe previously announced Sunset changes are now playable. Also playable is our newest Team Deathmatch map called “Glitch.”\nOther updates in this patch include: a map rotation change, Yoru’s Fakeout now interacting differently with certain Agent abilities, updates to Gekko’s abilities aka globules aka radivores aka Gekko’s besties, and more.\nGekko\nAs you have mastered Gekko’s utility since his last buff in patch 7.12 , we’ve noticed that his core play pattern of using and reclaiming his buddies has little to no downside. These changes to his globules put pressure on Gekko to more quickly reclaim them, and also allow for more counterplay for Gekko’s opponents to punish him if he’s too reckless.\nDizzy and Wingman are each getting improvements to their overall reliability to reduce cases where you hear or see them target and debuff an enemy, only to find that enemy is unaffected. These changes are targeted at addressing inconsistent behavior rather than a direct power increase for Gekko.\nDizzy is in a healthy state in terms of how often you successfully engage in its shooting counterplay, but we feel that Dizzy holds space and angles for too long. Additionally, given Gekko’s overall number of plants and defuses with Wingman , Thrash is available too frequently for its impact.\nWe hope these changes don’t wildly affect Gekko’s place in the ecosystem, but instead put him in a healthier long term place.\nYoru\nVarious abilities were not showing effects on Yoru’s Fakeout clone, which made it too easy to discern it from the real Yoru. We are going through abilities in the game and making sure they interact properly with Yoru’s Fakeout.\nSkye and Jett\nIntroducing “Glitch”, VALORANT’s Newest Team Deathmatch Map\nMap Rotations\nSunset\nWe’re updating Sunset’s B Site to address defensibility, post plant, and provide more ways to play on site. The B Main pivot box was adding a ton of pressure during post plant so we’ve opted to simplify the cover here. You can still play B Main during post plant, but it should now be easier to manage for retakers. A particular Cypher trip has also been removed with these changes.\nMaps\nWelcome to Stage E9A3!\nPremier"
  },
  {
    "title": "VALORANT Patch Notes 9.09",
    "patch": 9.09,
    "published": "2024-11-05",
    "final_content": "Hi folks! It’s Ash and I’m here to talk about Patch 9.09.\nWe fixed various bugs with Agents, such as Deadlock’s ANNIHILATION sometimes getting stuck at ledges, players being able to outrun Fade’s Prowler, and now Gekko’s Thrash won’t have as much difficulty making some small jumps.\nThere’s more to come with these year-end patches so stay tuned!\nBUG FIXES\nGeneral\nFixed a bug where the locking in animation in the Agent Select would not play immediately when instalocking.\nFixed a bug where you would see a blank screen as a tournament coach during Agent Select.\nAgent\nFixed a bug where Yoru would hold the Nocturnum scythe incorrectly after using Dimensional Drift.\nFixed a bug where Gekko’s Thrash had difficulty making some small jumps. Thrash should now jump more similarly to a player.\nFixed a bug where players pulled by Deadlock’s ANNIHILATION would sometimes get stuck at the top of ledges.\nFixed a bug where players could outrun Fade’s Prowler during its Bite. Prowlers should now continue to track its target during the Bite unless the target teleports outside its line of sight.\nFixed a bug where Astra would not receive the alert sound effect when being watched by Cypher’s Spycam.\nFixed a bug where Killjoy’s Turret would not display the deactivation range on the minimap after switching between her Turret and other abilities or weapons.\nFixed a bug where KAY/O with NULL/cmd active could be picked up by Yoru during Dimensional Drift.\nMaps\nAbyss\nFixed a bug that allowed the breakable doors in mid to be destroyed when shot from a certain angle.\nPREMIER UPDATES\nUpdated dropdowns on the standings tab to include Invite division in the division list for all zones. Selecting an Invite division to view will change your zone dropdown to the appropriate zone.\nBUG FIXES\nGeneral\nFixed an issue where you could load into Agent Select early by leaving your party as the “Match Found” popup appeared.\nRemoved an exploit that resulted in a stretched FOV, when using windowed-mode at a 4:3 resolution.\nPremier\nFixed an issue where the Competitor Crest title was not displayed on the Premier career page after earning that Crest.\nGENERAL UPDATES\nButtons that behave like radio buttons now look like radio buttons (instead of checkboxes).\nBUG FIXES\nSocial\nFixed a bug where if you have a long console block list, you would sometimes fail to join voice chat.\nFixed a bug where you could sometimes send a friend request to a player you had blocked.\nFixed a bug where sending a friend request to a player in the console-friends tab sometimes wouldn’t work."
  },
  {
    "title": "VALORANT Patch Notes 9.10",
    "patch": 9.1,
    "published": "2024-11-19",
    "final_content": "Morning, gamers. It’s Ash. Let’s talk about Patch 9.10.\nContinuing the spirit of year-end patches, we took a closer look at Controllers, Sentinels, and our boy Phoenix. There are quite a few changes to our gameplay systems and armory, including a rework to how the Combat Report works, adding the new Regen Shield, and tuning adjustments to weapons that will surely change the tides of future pistol rounds. Let’s just say, I’ll be buying Frenzy more often.\nBuckle up, this one’s hot.\nNEW ARMOR\nRegen Shield\nWe want to expand the strategic and tactical possibilities within the VALORANT competitive sandbox by introducing a new defensive option. Regen Shield has been added to the shop.\nCost: 650 Credits\nDamage Absorption: 25 HP\nRegeneration Pool: 50 HP\nAbsorbs 100% of incoming damage taken before damage to health occurs.\nAfter a brief delay, the shield regenerates by draining any remaining points left in the Regeneration Pool.\nAGENT UPDATES\nCypher\nCypher has been a dominant force with his map-wide information gathering and powerful kill setups. Because Cypher’s map-wide info is intended to be his unique strength, we want to target the efficacy of his kill potential.\nWe’re adjusting the Trap Wire to increase the counterplay time window after hitting it, so that there is more of a balance between a well-crafted setup and enemies deliberately trying to break trap wires. Additionally, this will help team compositions who don’t have as much utility to deal with unbreakable traps.\nCypher’s ultimate has been extra powerful after adding the second reveal and the removal of time restriction on enemy corpses in patch 5.10, so we’re bumping up the cost to put it more in-line with other comparable ultimates.\nTrap Wire :\nNow has a .5 second windup before the full wallhack reveal applies and fades in.\nTrap wire now has updated minimap icon treatment to better display what the trap wire is connected to.\nNeural Theft :\nUlt Cost 6 >>> 7\nSage\nSage has been feeling weak with relatively low pick rate in high-level play. We want to continue to hone in her ability to stall and slow down attackers when pushing into areas her team controls.\nWith the added dash speed reduction on Slowing Orb, well-timed, proactive casts of her Slowing Orb should feel rewarding and make slows a more meaningful debuff against duelists with dashes.\nHealing Orb : Self Heal 30HP >>> 50HP\nHeal time matched to ally heal at around 5 seconds\nSlowing Orb : Now will additionally reduce the dash speed of enemies caught inside the slowing zone by 50% similar to the Concuss changes in the Gameplay Systems Updates later in the patch notes.\nResurrection : Ult Cost 8 >>> 7\nDeadlock\nDeadlock’s ultimate will now always kill the target when the timer expires and they are not freed from the nanowire cocoon. Previously, captured targets only died if they reached the end location before the timer expired.\nDeadlock’s visuals for health on the Annihilation Cocoon and Barrier Mesh have been updated to make their health states more clear.\nOmen\nOmen has been a mainstay controller in high-level play for a long time. He particularly shines in his ability to create ambiguity throughout a round with the low cooldowns on his smokes. However, Omen’s ability to place one-way smokes inside level geometry provides significant defensive power with low counterplay. We’ll be keeping an eye out here for how these changes affect the overall controller ecosystem.\nDark Cover :\nDark Cover will now always fall to level geometry similar to other spherical smokes like Brimstone’s Sky Smoke, Clove’s Ruse, etc.\nThis should prevent Omen from placing one-way smokes on small ornamental pieces of Geometry, like the fuse boxes in the main of Split B and only allow him to place smokes where players can stand.\nClove\nRuse :\nAlly vs enemy clarity around Ruse casts for both alive and dead casts of smokes have been improved.\nEnemy smokes updated to appear more red than ally smokes\nNot Dead Yet :\nTime to get a kill: 12s >>> 10s\nThis change had been made accidentally in Patch 8.11 when fixing another bug, but the ultimate has been performing well at this tuning.\nPhoenix\nFollowing up from our updates to Duelist in 8.11, we’re taking an opportunity to let Phoenix shine brighter as the bold and confident duelist he is. His updates encourage him to get back to the fight quickly, break into sites with his Curve Ball and reward him for succeeding on entry.\nPhoenix now applies a Heal over time to himself whenever he touches his flames which persists even if he leaves the fire. This allows him to dip into his flames and then continue to press the offense.\nCurve Ball :\nChanged to the signature ability slot\nGrants a free charge on round start\n2 kill reset to generate an additional charge\nHot Hands :\nChanged to a non-signature ability\nCost 200 credits\nBlaze :\nWe want to support Phoenix’s hybrid “jack of all trades” utility value by allowing him to cast Blaze from safety for his teammates similar to other vision-blocking utility.\nInitial projectile goes through walls, allowing Blaze to function similarly to Harbor’s High Tide.\nJett\nDrift (Passive)\nBalance-impacting bug fix: Jett can no longer float while suppressed or detained.\nMAP UPDATES\nSunset\nWe updated global lighting for the entire map. Players should see an improvement in lighting quality and general visibility in previously darker portions of the map.\nGAMEPLAY SYSTEMS UPDATES\nThe changes to the gameplay systems in this patch are to better support VALORANT’s tactical gameplay. The combat report is intended to share in-game information easily. We’re always paying attention to how these systems are playing out, including ways that those systems can be used to create advantages that are counter to their intended use cases.\nCombat Report\nWhile the combat report should be a tool to provide gameplay context for what your impact was within a round of VALORANT, it has the occasional downside of leaking information to you that you otherwise would have had no way of knowing.\nThis happens most often with utility, such as Breach’s Flashpoint or Skye’s Guiding Light: You use your utility and get killed, but inadvertently also discover you blinded players you never saw or engaged with.\nWith these kinds of cases in mind, we’re making a change to the Combat Report:\nYour utility usage statistics now appear once the round has resolved rather than immediately upon death.\nIn its place, you will see an animated hourglass. Once the round ends, utility usage statistics will become available and persist through pre-round of the next round.\nConcusses\nWell-placed concusses should be just as consequential for our movement-oriented Duelists as other agents.\nWe also think this strengthens defensive teleports compared to dashes as more flexible repositioning options to compensate for their weakness in entry capabilities.\nConcusses now slow enemy dashes by 50%\nThis affects Jett’s Tailwind and Neon’s Slide.\nOverheal UI Visual Update\nWe’ve updated the way we show overheal shields in the bottom HUD to improve legibility.\nThis affects how we show bonus HP after using Reyna’s Devour and Clove’s Pick-Me-Up.\nSmoke Visual Update\nVisual cues have been added to the inside of the smoke to let you know when they are about to disappear to better support decision making. These cues match up with the ones that exist on the outside of the smoke.\nThe following Agents’ smokes have been affected:\nAstra\nBrimstone\nOmen\nClove\nWEAPONS UPDATES\nWe’re making some tuning adjustments to weapons.\nAs VALORANT has grown and evolved, you all have learned how to take advantage of different methods of swinging and peeking. Because of the way bullet tagging in VALORANT works (slowing down when shots land on you), shot players are often tagged and then slowed down into the walking state and as a result their weapons become quickly more accurate.\nWe want to maintain this intuitive relationship between player movement speed and accuracy, so we’re opting to increase all moving state accuracy penalties (AKA “movement error”) and encourage intentionality in movement when shooting.\nThe Sheriff and the Frenzy already have different movement error inaccuracies compared to the other pistols, which are valuable to maintain for the sake of their identities.\nSMGs are unaffected, as we believe that their mobile accuracy is a core part of how the weapons are unique within the arsenal.\nThe Ghost having more bullets than the Frenzy didn’t make intuitive sense given their unique strength and weakness profiles amongst the pistols.\nPistol Inaccuracy Changes\nAll Pistols (except the shorty)\nMoving while crouching Inaccuracy: .1 >>> .5\nClassic\nRight Click Running Inaccuracy: 1.3 >>> 1.5\nRight Click Burst Jumping Inaccuracy: 2.1 >>> 2.25\nWalking Inaccuracy: 0.84 >>> 1.1\nRun Inaccuracy: 2 >>> 2.3\nGhost\nWalking Inaccuracy: 0.84 >>> 1.1\nRun Inaccuracy: 2 >>> 2.3\nRifles\nAll Rifles\nWalk Inaccuracy: 2 >>> 3\nRun Inaccuracy: 5 >> 6\nMachine Guns\nAll Machine Guns\nWalk Inaccuracy: 2.4 >>> 3\nRun Inaccuracy: 6 >>> 6.5\nPistol Bullet Count Changes\nFrenzy\nBullet Count Increased 13 >>> 15\nGhost\nBullet Count Reduced 15 >>> 13\nThere have been fewer Phantom purchases over time with new maps being released and higher proficiency in shooting. The Phantom and Vandal’s current differences are intended to keep their identities unique while still being relatively competitive with each other. These changes are intended to make the Phantom feel better to use primarily and reduce frustrating instances of headshots doing less damage than expected at different distances. These breakpoints will remove some instances of 140 headshots and all instances of 124 in 1 headshots (excluding wall penetration).\nPhantom\nDamage fall-off changed:\nPreviously:\n39 damage per bullet (0 - 15m)\n35 damage per bullet (15 - 30m)\n31 damage per bullet (30m+)\nNow:\n39 damage per bullet (0 - 20m)\n35 damage per bullet (20m+)\nBUG FIXES\nAgents\nKilljoy\nFixed a bug with Alarm Bot where it did not play the proper reactivation ceremony and would instantly reactivate when Killjoy reentered its range.\nClove\nFixed a bug where Meddle was hitting through level geometry.\nMaps\nFixed an issue where ambient audio elements were not playing pre-round for Pearl, Breeze, and Sunset.\nPREMIER UPDATES\nCLIENT UPDATES\nBUG FIXES\nPremier\nBUG FIXES\nAgents"
  },
  {
    "title": "VALORANT Patch Notes 9.11",
    "patch": 9.11,
    "published": "2024-12-10",
    "final_content": "Hi, all. Kenny here.\nToday’s the day. Yes—the Neon nerfs are here. Along with that, we’ve got some nice buffs for Vyse, some pretty major updates of the in-game ping system, QoL improvements to upgrading your weapon skins, and a few other tweaks.\nPatch 9.11 is the last patch of the year. So get in there, frag out, and practice up ahead of the new year and the ranked reset.\nALL PLATFORMS\nBefore Ping Update\nAfter Ping Update"
  },
  {
    "title": "VALORANT Patch Notes 9.01",
    "patch": 9.01,
    "published": "2024-07-16",
    "final_content": "Howdy, gamers. Jo-Ellen, here.\nThere are a lot of Console updates in this patch including some for Neon, Raze, and Iso. Lotus is also entering the scene on Console. Read more below.\nUpdated the animation for the Outlaw and its skinlines so that it is more apparent when the weapon is ready to be fired.\nGeneral\nFixed a bug where Neon could equip faster out of her slide than intended by manually inputting an equip action.\nGameplay Systems\nFixed a bug where AFK players were able to start the vote for surrender.\nFixed an issue when exiting Cypher’s Spycam that causes a brief stutter for Spectators.\nFixed an issue with Tactical Callouts displaying in chat regardless of the option being turned off in Settings.\nFixed an issue with bullet tracers appearing for guns picked up regardless if they are turned off in Settings.\nFixed an issue regarding Sage and Clove resurrections not being visible for Spectators and Observers.\nFixed a performance degradation issue caused by auto-respawn by spike explosion in Custom Game modes.\nMaps\nAbyss\nCleaned up lots of Cypher’s Spycam spots to prevent visual issues or unintended placements.\nImproved Wingman’s Spike plant pathing on A site.\nCleaned up ability and player collision in a variety of spots across the map.\nFixed a bug where the Minimap could be oriented upside down with certain settings active.\nFixed a visual bug seen when falling off of the map on A site.\nFixed a bug where Viper’s Pit could spread farther than intended on A site.\nSocial\nWhen changes happen to your party, there is a chance you may see \"<MISSING STRING ENTRY TABLE>\" in your chat log.\nPick 'Ems Beta is coming for VALORANT Champions 2024!\nStarting on July 26th, you will have access to the Champions Seoul Group Stage in-client and on the web. You’ll get to:\nPredict the advancing teams for points, earning extra points for correctly guessing the exact placement.\nEarn rewards for playing, with the best of the best earning more exclusive rewards.\nAnd see how you stack up against other experts and creators.\nFinally, prepare for the Playoffs Stage next patch where you’ll fill out the full double elimination bracket at once.\nLook out for more details on how to participate later this month!\nGameplay Systems\nFixed an issue involving the Ping Wheel getting stuck on the interface when bound to the Z key.\nPremier\nHey IBIT zone Premier Players!\nThere was an issue with matchmaking that prevented matches from being played in the first 2 weeks of the Episode 9 Act 1 stage. Contender and Invite divisions were unaffected and these teams successfully played their matches.\nIssue has been fixed and teams should be able to find matches successfully for week 3 and on.\nAny team that plays a match in the IBIT zone in week 6 and before will automatically qualify for playoffs.\nTeams that have already played a match in another EU zone can still earn the playoff qualification in IBIT, but will require teams to create a new roster in the IBIT zone and play a match.\nTeams will qualify for playoffs by receiving 600 points before the start of week 7 matches.\nFor example, if your team has 25 points at the end of week 6, then your team will have 625 points before you play your week 7 matches.\nIt is now possible to freely rebind non-ultimate Ability Button mappings.\nAdded settings for inverting map cursor controls.\nNeon\nSlide\nRe-equip Speed changed from Fast to Instant.\nRaze\nSecond Blast Pack\nSecond Blast Pack’s horizontal force has been reduced.\nIso\nDouble Tap : Duration: 20s >>> 12s\nSignature kill reset removed.\nLotus enters Competitive, Unrated, Swift Play, and Deathmatch queues.\nDeathmatch\nDeathmatch is experiencing an issue and will be unavailable on Console until a fix can be shipped.\nUpdated the notification indicator on the social card so that it’s easier to tell when you have a party invite even when the social panel is closed.\nAdded voice indicators to the Party tab in the social panel, so you can see who is speaking.\nAdded a button to leave the party to the My Party section of the Party tab in the social panel.\nGeneral\nTraditional Preset Weapon Switching Fixes\nFixed issue where unequipping abilities wouldn't respect the “Auto-Equip Prioritizes (Strongest/Latest Setting)”.\nFixed issue where you couldn't switch off from the Spike when you had no primary when using the ‘Traditional Controls’ Preset.\nFixed an issue where you could sometimes lose visual highlighting on the buttons you hover over in the front-end menus.\nFixed issues that could cause you to be unable to leave the Range.\nAgent\nSova\nRecon Bolt\nFixed an issue where Recon Bolt did not properly apply AimAssist to Revealed Targets.\nFade\nHaunt\nFixed an issue where Haunt did not properly apply AimAssist to Revealed Targets.\nFixed an issue where AimAssist was incorrectly being applied when certain abilities were equipped:\nFade - Nightfall\nChamber - Rendezvous\nHarbor - Cascade\nHarbor - Cove\nViper - Poison Cloud\nViper - Toxic Screen\nViper - Viper’s Pit\nYoru - Fakeout\nYoru - Dimensional Drift\nGameplay Systems\nFixed issue where you could be in Focus Mode while inspecting your weapon.\nCompetitive Systems\nFixed an issue where EOG screens when viewing matches in Match History will disappear and be inaccessible\nSocial\nFixed a bug where your presence sometimes failed to update after a match.\nGeneral\nWhen navigating Surrender menus, there's a chance your controls can become locked for an entire round. Due to this, we've elected to disable the Surrender and Remake menus until we can properly fix the issue. Draw will remain functional."
  },
  {
    "title": "VALORANT Patch Notes 9.02",
    "patch": 9.02,
    "published": "2024-07-30",
    "final_content": "Hey, y’all. It’s Jo-Ellen and I’m here once more with Patch Notes 9.02.\nWhat you’ll see below: a Player Behavior update whether you’re on Console or PC, an updated Combat Report and Basic Training now available for PC, and Icebox entering the scene on Console.\nAgents\nGameplay Systems\nMaps\nGeneral\nGameplay Systems\nPerformance\nSocial\nWeapons"
  },
  {
    "title": "VALORANT Patch Notes 9.06",
    "patch": 9.06,
    "published": "2024-09-24",
    "final_content": "Hi, everyone. Jo-Ellen here. We’ve got a bunch of updates in Patch 9.06.\nIn particular, you’ll now be able to see if you’re picking up a Reaver vandal\n  or Forsaken vandal, new VALORANT PC players will now get tips on how to play,\n  and the voting system will now no longer count AFK players in the draw vote.\nAs always, let us know what you think of the updates. We’re always looking for\n  feedback.\nAGENT UPDATES\nGAMEPLAY SYSTEMS UPDATES\nMAP UPDATES\nPLAYER BEHAVIOR UPDATES\nSOCIAL UPDATES\nWEAPONS UPDATES\nBUG FIXES\nAgents\nCosmetics\nGameplay Systems\nMaps\nGAMEPLAY SYSTEMS UPDATES\nSOCIAL UPDATES\nGAMEPLAY SYSTEMS UPDATES\nMAPS UPDATES"
  }
]